export default {
    "backendPostfix": "uk",
    "auth": {
        "notifications": {
            "registration": "Ваш акаунт зареєстровано, увійдіть, будь ласка",
            "resetPasswordConfirm": "Вам на пошту відправлено новий надійний пароль.",
            "verificationCodeSend": "Верифікаційний код надіслано!",
            "unautorized": "Будь-ласка, увійдіть"
        },
        "checkout": {
            "text1": "Оформлення покупки",
            "text2": "Я новий користувач",
            "text3": "Увійдіть або зареєструйтеся до магазину ТЕП, щоб скористатися персональними пропозиціями!",
            "text4": "Увійти",
            "text5": "Створити обліковий запис",
            "text6": "Я вже зареєстрований"
        },
        "loginForm": {
            "text1": "Неправильна адреса електронної пошти або пароль",
            "text2": "Електронна пошта",
            "text3": "Введіть пошту",
            "text4": "Пароль",
            "text5": "Введіть пароль",
            "text6": "Забули пароль?",
            "text7": "Увійти",
            "text8": "або"
        },
        "socialLogin": {
            "text1": "Продовжити з Google",
            "text2": "Продовжити з Facebook"
        },
        "emailconfirmation": {
            "text1": "Підтвердження емейлу",
            "text2": "Ми надіслали вам верифікаційний код на вашу електронну пошту",
            "text3": "Надіслати код повторно",
            "text4": "Спробуйте через",
            "text5": "секунд"
        },
        "emailConfirmationForm": {
            "text1": "Ваш профіль успішно оновлено!",
            "text2": "Не вірний код доступу",
            "text3": "Верифікаційний код",
            "text4": "Введіть код",
            "text5": "Підтвердити"
        },
        "resetpassword": {
            "text1": "Встановити новий пароль",
            "text2": "Введіть свою адресу електронної пошти і ми надішлемо тобі новий пароль.",
            "text3": "Повернутись до входу",
            "success": {
                "text1": "Ми отримали ваш запит на відновлення паролю",
                "text2": "Перегляньте електронну пошту, вам повинен прийти код доступу",
                "text3": "Надіслати код повторно"
            }
        },
        "resetPasswordForm": {
            "text1": "Неправильне ім'я електронної пошти",
            "text2": "Електронна пошта",
            "text3": "Введіть пошту",
            "text4": "Продовжити"
        },
        "signin": {
            "text1": "Увійдіть до свого особистого кабінету",
            "text2": "Увійдіть або зареєструйтеся до магазину ТЕП, щоб скористатися персональними пропозиціями!",
            "text3": "Створити обліковий запис",
            "text4": "Ще не має облікового запису?"
        },
        "signup": {
            "text1": "Створити профіль",
            "text2": "Якщо у Вас вже є профіль, ви можете увійти у Ваш обліковий запис.",
            "text3": "Увійти",
            "text4": "Вже є обліковий запис?"
        },
        "registrationForm": {
            "text1": "Ця електронна пошта вже зайнята",
            "text2": "Ім’я",
            "text3": "Ваше ім’я",
            "text4": "Прізвище",
            "text5": "Ваше прізвище",
            "text6": "Електронна пошта",
            "text7": "Ваша пошта",
            "text8": "Пароль",
            "text9": "Введіть пароль",
            "text10": "Я зацікавлений(-на) в оптових закупівлях",
            "text11": "Я хочу отримувати інформацію щодо новинок, акцій та пропозиції від ТЕП",
            "text12": "Я прочитав(-ла) і зрозумів(-ла)",
            "text13": "політику конфіденційності.",
            "text14": "Створити профіль"
        }
    },
    "account": {
        "text1": "Привіт,",
        "text2": "Бажаєш змінити обліковий запис?",
        "text3": "Змінити",
        "text4": "Історія покупок",
        "userAccount": {
            "text1": "Змінити пароль"
        },
        "userAccountForm": {
            "text1": "Ваш профіль успішно оновлено!",
            "text2": "Пошта неправильна, або вже зареєстрована",
            "text3": "Ім’я",
            "text4": "Ваше ім’я",
            "text5": "Прізвище",
            "text6": "Ваше прізвище",
            "text7": "Електронна пошта",
            "text8": "Ваша пошта",
            "text9": "Телефон",
            "text10": "День народження",
            "text11": "pppp-мм-дд",
            "text12": "Профіль",
            "text13": "Звичайний",
            "text14": "Інший",
            "text15": "Змінити профіль"
        },
        "userAddressForm": {
            "text1": "Адреса",
            "text2": "Місто",
            "text3": "Область",
            "text4": "Індекс",
            "text5": "Будь ласка, введіть валідний поштовий індекс"
        },
        "userSettings": {
            "text1": "Ваш акаунт успішно видалено!",
            "text2": "Спосіб комунікації",
            "text3": "Отримання пропозицій і новин",
            "text4": "через:",
            "text5": "Електронна пошта",
            "text6": "СМС",
            "text7": "Видалити профіль",
            "text8": "Ви можете видалити свій обліковий запис ТЕП у будь-який момент. Це призведе до видалення профілю та пов&apos;язаної з ним інформації."
        },
        "deleteAccountConfirm": {
            "text1": "Видалити профіль?",
            "text2": "Ви дійсно хочете видалити свій обліковий запис ТЕП? Це призведе до видалення особистого профілю та пов&apos;язаної з ним інформації.",
            "text3": "Ні",
            "text4": "Так"
        },
        "changePasswordForm": {
            "text1": "Паролі не співпадають",
            "text2": "Неправильний пароль",
            "text3": "Пароль змінено",
            "text4": "Ваш пароль був зміненний на новий, тепер Ви зможете зайти в обліковий запис використовуючи новий пароль.",
            "text5": "Добре",
            "text6": "Змінити пароль",
            "text7": "Старий пароль",
            "text8": "Введіть старий пароль",
            "text9": "Новий пароль",
            "text10": "Введіть новий пароль",
            "text11": "Повторіть новий пароль",
            "text12": "Введіть новий пароль",
            "text13": "Змінити"
        },
        "accountTabs": [
            "Обліковий запис", "Адреса", "Налаштування"
        ],
        "birthdayForm": {
            "months": [
                { "value": "01", "label": "Січень" },
                { "value": "02", "label": "Лютий" },
                { "value": "03", "label": "Березень" },
                { "value": "04", "label": "Квітень" },
                { "value": "05", "label": "Травень" },
                { "value": "06", "label": "Червень" },
                { "value": "07", "label": "Липень" },
                { "value": "08", "label": "Серпень" },
                { "value": "09", "label": "Вересень" },
                { "value": "10", "label": "Жовтень" },
                { "value": "11", "label": "Листопад" },
                { "value": "12", "label": "Грудень" }
              ],
            "text1": "День народження",
            "text2": "День",
            "text3": "Місяць",
            "text4": "Рік",
            "text5": "Змінити"
        },
        "userSocials": "Акаунт в соціальних мережах",
        "cart": {
            "text1": "Кошик",
            "text2": "товарів у кошику",
            "text3": "Кошик порожній",
            "text4": "На жаль, твій кошик порожній. Але ще не пізно це виправити! Увійдіть, щоб додати товари зі списку &quot;Улюблене&quot; або перейдіть до списку товарів, щоб ознайомитись з асортиментом.",
            "text5": "Увійти",
            "text6": "Перейти до товарів",
            "text7": "Видалити всі товари",
            "text8": "Оформити"
        },
        "cartList": "Оформити",
        "cartProductCard": {
            "text1": "см",
            "text2": "товар",
            "text3": "Разом"
        },
        "totalPriceBlock": {
            "text1": "Повна сума",
            "text2": "Доставка",
            "text3": "Ще не прорахована",
            "text4": "Разом по замовленню із ПДВ"
        },
        "favourite": {
            "text1": "Улюблене",
            "text2": "Ваш список пустий",
            "text3": "Ще не готові зробити покупку? Збережіть тут, поки не вирішите. Ви можете переглянути наш асортимент та обрати товари, які Вам до вподоби!",
            "text4": "На головну",
            "text5": "Видалити всі товари",
            "text6": "Загальна вартість"
        },
        "order": {
            "text1": "Замовлення №",
            "text2": "Статус:",
            "text3": "Відстежити",
            "text4": "Детальніше"
        },
        "orderHistory": "Історія замовлень",
        "orderList": "У вас ще немає замовлень",
        "orderProductCard": {
            "text1": "см",
            "text2": "товар",
            "text3": "Разом"
        },
        "emailconfirmation": {
            "text1": "Сталася помилка, будь-ласка, спробуйте ще раз",
            "text2": "Підтвердження емейлу",
            "text3": "Ми надіслали вам верифікаційний код на вашу електронну пошту",
            "text4": "Надіслати код повторно",
            "text5": "Спробуйте через",
            "text6": "секунд"
        },
        "breadcrumbs": {
            "text1": "Головна",
            "text2": "Профіль",
            "text3": "Історія замовлень"
        }
    },
    "company": {
        "pages": [
            "Про бренд ТЕП", "Співпрація та партнерство", "Робота в ТЕП", "Магазини ТЕП", "Технології", "Блог",  "Каталог ТЕП"
        ],
        "breadcrumbs": {
            "text1": "Головна",
            "text2": "Компанія",
            "text3": "Про бред ТЕП",
            "text4": "Співпраця та партнерство",
            "text5": "Залишити заявку",
            "text6": "Робота в ТЕП",
            "text7": "Технології",
            "text8": "Блог",
            "text9": "Магазини ТЕП",
            "text10": "Приватні марки",
            "text11": "Гуртові продажі"
        },
        "about": {
            "text1": "Бренд ТЕП",
            "text2": "Наша місія - нести затишок і тепло в дім – місце, де комфортно та можна бути собою. Назва ТЕП походить від слова \"тепло\" (укр.). Наші цінності: тепло рідного дому, вдячність, сім’я, здоров’я, турбота та гармонія.",
            "text3": "Місія та бренд ідея",
            "text4": "Будь собою та поводься справжньо, здійснюй будь-які мрії, ти зможеш і ніхто тебе не зупинить. Постіль — місце сили для справжнього тебе із власними мріями!",
            "text5": "Наші цілі та мрії",
            "text6": "Ми дбаємо про те, щоб створювати для клієнта найкомфортніші умови відпочинку. Наша мета — допомогти нашому аватару створити найліпше місце відпочинку, в якому людина зможе відчути себе справжньою та наповненою силю Ми хочемо, щоб ви любили, насолоджувалися життям, здійснювали мрії та були щасливі.",
            "text7": "Виробництво",
            "text8": "Досвідчені працівники Balakkom дійсно люблять домашній текстиль. Ми піклуємось про екологічність продукції, що виготовляємо, і маємо сертифікацію OEKO-TEX Standard 100. Балакком використовує безпечні технології виробництва та сучасне устаткування. Для нас важливе самопочуття і добробут кожного клієнта та працівника. Ми підтримуємо відповідальне виробництво і споживання, а наші вироби – довговічні і стійкі до зношування. Турбота про довкілля та думка про майбутні покоління дають нам наснагу і натхнення розвиватись безпечно та відповідально, впроваджуючи нові тенденції сталого розвитку.",
            "advantages": {
                "text1": "Переваги",
                "content": [
                    {
                      "text": "Оформлення замовлення на сайті та в додатку 24/7"
                    },
                    {
                      "text": "Допомога консультанти через чат або дзвінок"
                    },
                    {
                      "text": "Розрахуватися зручним для вас способом: Apple/Google Pay, Visa/Mastercard"
                    },
                    {
                      "text": "Можливість співпраці та бути нашим офіційним дистриб’ютором в Україні чи закордоном"
                    },
                    {
                      "text": "Наявна пропозиція франшизи ТЕП"
                    },
                    {
                      "text": "Сезонні, солодкі знижки. Чим вище сума закупівлі, тим істотніша знижка. Чим довша історія спільної роботи, тим вигідніші умови для співпрацію"
                    },
                    {
                      "text": "Швидка обробка та відправка замовлення"
                    },
                    {
                      "text": "Швидко повернути товар при наявності нарікань до його якості."
                    },
                    {
                      "text": "Більше ніж 100+ різних дизайнів постільної білизни, інноваційні подушки та ковдри, наматрацники, простирадла"
                    },
                    {
                      "text": "ТЕП – це про любов до наших клієнтів та створення історій, де затишок, комфорт та здоров’я передусім."
                    }
                ]
            },
            "ourHistory": {
                "text1": "Історія в цифрах",
                "content": [
                    "Наша історія починається наприкінці 20-го століття з пошиття ковдр із тканин з чотирьох дизайнів в місті Чернівці, Україна. Саме тоді зародилася ідея створення бренду ТЕП, який подарував би людям якісний та доступний домашній текстиль. Назва ТЕП походить від слова \"тепло\" (укр.). Усього 14 людей працювало тоді над загальною улюбленою справою. Пошиття постільної білизни відбувалось в розмірах полуторний та євростандарт, а ковдри шились на двох одноголкових стьобальних машинах.",
                    "Переїзд на нову, велику площу для виробництва та головного офісу. Ми - компанія «Балакком» – закуповуємо нові перші чотиригольні комп'ютерно-автоматичні машини для різних дизайнів простібування та розмірів (дитячі, полуторні, двоспальні, євро стандарт). Крім того, у нас з'являється можливість міняти малюнок на ковдрах. А у 2001 році ми починаємо пошиття подушок!",
                    "Придбали італійську багатоголкову стьобальну машину Meсa, яка дозволила шити більш технологічні ковдри, зробивши цим їх ще якіснішими. Саме в цей час компанія починає також пошиття покривал на виробництві. А наступного 2003 року Балакком запускає пошиття постільної білизни торгової марки ТЕП.",
                    "Закуповуємо німецьку машину Dilo для виробництва нетканого термоскріпленого матеріалу. Це дало змогу збільшити асортимент та випуск ковдр, наматрацників і покривал.",
                    "Компанія закупила першу автоматичну лінію для наповнювачів чохлів подушок різним типом сировини, у тому числі силіконізованих куль з порожнистих волокон.",
                    "Балакком купує автоматизовану лінію для виробництва ковдр: чесальну машину для ковдр Asseline-Thibeau, багатоголкові машини Mammut.",
                    "Докупка двох додаткових машин для виробництва ковдр та наматрацників, а вже наступного 2013 року компанія купує нове обладнання для наповнення чохлів для подушок з ультратонкими волокнами.",
                    "Компанія Балакком виготовляє 30 видів ковдр, 50 видів подушок, 8 видів покривал, 20 наматрацників, 4 сегменти постільної білизни і є серед лідерів ринку домашнього текстилю. В компанії працює близько 500 співробітників, Балакком не раз вигравала сертифікати та перемоги в номінаціях «Краща якість» та «Кращі товари», має сертифікат ISO 9001, що підтверджує високі стандарти якості компанії. Наша місія – подарувати здоровий сон кожному, цим зробити вас щасливішими та успішнішими.",
                    "Наша місія — забезпечити здоровий сон кожного, зробити людей щасливішим та успішнішим. Бренд ТЕП та компанія Balakkom отримали оновлений стиль та брендинг."
                ]
            },
            "technologies": {
                "text1": "Технології",
                "text2": "Balakkom використовує найсучасніші технології виробництва та забезпечує бренд ТЕП продуктами найвищої якості. До запатентованих технологій компанія відносить ефект мембрани в подушках та ковдрах, ультразвукова пайка для покривал, наповнювач Double Air для подушок та ковдр.",
                "text3": "Дізнатись більше"
            }
        },
        "blog": {
            "author": {
                "text1": "Автор статті",
                "text2": "Теги",
                "text3": "Дата",
                "text4": "Поділитись"
            },
            "authorDetails": {
                "text1": "Автор статті",
                "text2": "Дата",
                "text3": "Час читання",
                "text4": "10 хв"
            },
            "blogHead": {
                "text1": "Блог",
                "text2": "Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення."
            },
            "blogPlan": {
                "text1": "План блогу:",
                "text2": "Наповнювач для ковдри",
                "text3": "Особливості використання дитячої ковдри",
                "text4": "Спосіб прання ковдри",
                "text5": "Поради по догляду",
                "text6": "Вибір ковдри під сезон"
            },
            "moreArticles": "Більше статтей"
        },
        "cooperation": {
            "text1": "Приватні марки",
            "text2": "Гуртові продажі",
            "text3": "Хто ми",
            "text4": "Ми одна з найбільших  компаній домашнього текстилю в України",
            "text5": "Підприємство розташоване в безпечній частині України",
            "text6": "Маємо власне виробництво і сертифіковане, інноваційне обладнання",
            "text7": "Працюємо з 1996 року і маємо висококваліфіковану команду галузевих спеціалістів",
            "text8": "Використовуємо сучасні технології для забезпечення значних обсягів виробництва за дотримання високої якості продукції.",
            "text9": "Маємо сертифікацію OEKO-TEX Standard 100 - це система незалежних перевірок текстильної продукції на вміст шкідливих речовин.",
            "privatelabels": {
                "text1": "Створення власної торгової марки",
                "text2": "Про співпрацю",
                "text3": "Текстильна компанія Balakkom пропонує виробництво виробів домашнього текстилю під вашою торговою маркою. Ми працюємо з уже готовими специфікаціями, та за потреби можемо розробити новий продукт для вашої товарної лінійки. Балакком відповідає за повний виробничий цикл та доставку. Зацікавлені у створенні власної торгової марки текстилю або шукаєте виробника з високими стандартами якості? Звертайтесь до нас за розробкою та виготовленням товарів за наданими специфікаціями. Ми вже виконуємо замовлення для брендів з Німеччини, Австрії, Франції, Нідерландів, Румунії, Саудівської Аравії, Білорусі, Молдови, Болгарії та Ізраїлю.",
                "text4": "Пропонуємо виготовлення",
                "text5": "подушок",
                "text6": "ковдр",
                "text7": "постільної білизни",
                "text8": "покривала",
                "text9": "наматрацників",
                "text10": "простирадла",
                "text11": "розробка продукції по індивідуальному",
                "text12": "замовленню клієнта",
                "text13": "Алгоритм взаємодії з клієнтом",
                "text14": "Мінімальна партія замовлення",
                "text15": "1. Ковдри - від 100 шт. одного розміру та виду",
                "text16": "2. Подушки, постільна білизна, простирадла, наматрацники, покривала - від 100 шт. одного розміру та виду",
                "text17": "Пакування",
                "text18": "Можлива розробка власної етикетки та упаковки",
                "text19": "Індивідуальна упаковка товару (сумка, туб-пакет, сумка-економ, коробка, ПВХ-пакування)",
                "text20": "Сертифікати",
                "text21": "Сучасні технології, новітнє устаткування та потужна команда висококваліфікованих спеціалістів дають змогу позиціонувати нас як надійного виробника якісної продукції.",
                "text22": "Підтвердженням чого є наявність Сертифікату -Oeko-Tex  Standard 100. Компанія працює згідно стандартів погодженних Міністерством охорони здоров’я України: -ТУ У 30501814.002-99; -ТУ У 30501814.001-99; -ТУ У 17.4-30501814-005:2006. Перевірено на відповідність законодавству України  ДП “УКРМЕТРТЕСТСТАНДАРТ” 31.01.2024 року та внесено до книги обліку №105/000680/04.",
                "stages": [
                    "Заявка на створення специфікацію продукту",
                    "Попередній прорахунок вартості",
                    "Погодження візуалу продукта та його упаквання",
                    "Узгодження замовлення",
                    "Внесення авансу",
                    "Запуск у виробництво",
                    "Замовлення прямує до складу ТЕП",
                    "Усі задоволенні"
                ]
            },
            "wholesale": {
                "text1": "Гуртові продажі",
                "text2": "Про співпрацю",
                "text3": "Бренд перевірений часом – ТЕП, що відомий як якісний та доступний домашній текстиль на українському ринку. Ковдри, подушки або постільна білизна ТЕП є у кожній третій українській родині. ТЕП виник у момент заснування компанії в 1996 році і до сих пір є лідером ринку в Україні.",
                "text4": "Переваги працювати саме з нами"
            },
            "advantages": [
                {
                  "description":
                    "Широкий асортимент продукції, який постійно поновлюється новинками (слідкуємо за тенденціями моди на ринку)"
                },
                {
                  "description":
                    "За Вами закріплюється персональний менеджер, який надасть всю необхідну інформацію і допоможе зробити замовлення"
                },
                {
                  "description":
                    "Додаємо Вас у спільноту Viber, де Ви своєчасно дізнаєтесь про всі новинки, акції та спеціальні пропозиції"
                },
                {
                  "description":
                    "Зручно зробити онлайн  замовлення через додаток “ТЕП”, маючи доступ до наявного товару на складах в реальному часі"
                },
                {
                  "description":
                    "Вартість товарів нижча від -40% від роздрібної ціни на нашому сайті або роздрібному магазині"
                },
                {
                  "description":
                    "Безкоштовна доставка Укрпоштою (при замовленні від 7 тис. грн) "
                },
                {
                  "description":
                    "Продукція виготовляється згідно стандартів якості, за ретельно спланованим виробничим процесом. На кожному етапі проходить контроль якості"
                }
              ],
            "conditions": {
                "text1": "Умови співпраці",
                "text2": "Зацікавились?",
                "text3": "Якщо ви зацікавились в співпраці з ТЕП ви можете зв’язатись з нами з вашою пропозицією.",
                "text4": "Залишити заявку"
            }
        },
        "stores": {
            "map": {
                "text1": "Магазини ТЕП",
                "text2": "Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення."
            },
            "storesInfo": {
                "text1": "Тут ви можете знайти магазин з товарами ТЕП",
                "text2": "Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення.",
                "text3": "Місто",
                "text4": "Обрати місто",
                "text5": "Адреса",
                "text6": "Обрати адресу",
                "text7": "Магазин ТЕП знаходиться за адресою",
                "text8": "Україна",
                "text9": "Графік роботи",
                "stores": [
                    {
                      "id": "1",
                      "city": "Киів",
                      "stores": [
                        {
                          "id": "1.1",
                          "address": {
                            "street": "вул. Євгена Сверстюка 2Б",
                            "mall": "ТЦ Лівобережний",
                            "postalCode": "02002"
                          },
                          "schedule": "Понеділок - неділя",
                          "workingHours": "10:00 - 20:00"
                        }
                      ]
                    },
                    {
                      "id": "2",
                      "city": "Львів",
                      "stores": [
                        {
                          "id": "2.1",
                          "address": {
                            "street": "вул. В’ячеслава Чорновола 63А",
                            "mall": "",
                            "postalCode": "79019"
                          },
                          "schedule": "Понеділок - п'ятниця",
                          "workingHours": "9:00 - 18:00"
                        }
                      ]
                    },
                    {
                      "id": "4",
                      "city": "Чернівці",
                      "stores": [
                        {
                          "id": "4.1",
                          "address": {
                            "street": "вул. Комунальників 4Б",
                            "mall": "",
                            "postalCode": "58023"
                          },
                          "schedule": "Понеділок - п'ятниця",
                          "workingHours": "9:00 - 18:00"
                        }
                      ]
                    },
                    {
                      "id": "5",
                      "city": "Ужгород",
                      "stores": [
                        {
                          "id": "5.1",
                          "address": {
                            "street": "вул. Корзо",
                            "mall": "ринок Краснодонців, маг. 16-17",
                            "postalCode": "88000"
                          },
                          "schedule": "Вівторок - неділя",
                          "workingHours": "9:00 - 16:00"
                        }
                      ]
                    }
                  ]
            }
        },
        "technologies": {
            "moreTechnologies": "Більше технологій",
            "technologies": {
                "data": [
                    {
                        "id": "1",
                        "title": "Змішування наповнювачів",
                        "details": [
                            "Змішування наповнювачів – це чудова технологія, яка дозволяє виробляти різноманітні продукти, які б відповідали запитам споживачів.",
                            "Традиційні наповнювачі – це популярний вибір, але іноді для того, щоб зробити найкраще, варто поєднати кілька видів волокон. Наприклад, наповнювач з екстрактом алое роблять з синтетичного волокна, але натуральний екстракт має ряд переваг та особливостей. Також часто поєднують волокна бавовни з поліефірним силіконізованим: синтетичні надають міцності та значно краще тримають форму, а бавовна додає об’єму."
                        ]
                    },
                    {
                        "id": "2",
                        "title": "Технологія, яка реалізується завдяки унікальній лінії укладки волокон",
                        "details": [
                            "Наша особливість в перехрестному укладанні волокон. В той час у інших виробників - пряме накладання. Така технологія не дозволяє наповнювачу збиватись та рівномірно розприділяє його по площі. Це дозволяє прати наші вироби.",
                            "Механізм працює так: необроблене волокно (натуральне, штучне чи змішане) механічно «розчісують», щоб воно стало м’яким та пухнастим, а тоді машина рівномірно розподіляє наповнювач в, так звані, листи. Вони можуть бути різної товщини. Інші виробники часто вистилають наповнювач непрочесаними шарами , тому ковдра з такого наповнювача швидше збивається, стає тоншою в окремих місцях."
                        ]
                    },
                    {
                        "id": "3",
                        "title": "Виробництво нетканих матеріалів",
                        "details": [
                            "Балакком – це єдине в Україні виробництво, яке виготовляє широкий спектр синтепону (нетканий синтетичний матеріал з поліефірних волокон). Його вага варіюється від 65г/м2 до 1кг/м2.",
                            "Механізм працює так: в машину завантажують поліефірні волокна, їх прочісують, щоб надати м’якості та пухкості, а тоді під впливом високих температур рівномірно викладають в шар синтепону і “випікають”, щоб скріпити волокна між собою. Вони можуть мати різну товщину та вагу (щільність)."
                        ]
                    },
                    {
                        "id": "4",
                        "title": "Ультразвук",
                        "details": [
                            "Ультразвукова спайка – це ще одна з технологій нашого виробництва. Суть полягає в тому, що візерунки на тканині створюються без прошивки нитками, а механізмом, який точково нагріває тканину до такої температури, що «виплавлює» візерунки.",
                            "Такий спосіб виконує як естетичну функцію, так і практичну. Наприклад, у декоративних подушках з велюру, ця спайка скріплює тонкий шар синтепону, який забезпечує м’якість зовнішнього чохла подушки. Також це значно міцніше, ніж нитки і не створює додаткових проблем."
                        ]
                    }
                ],
                "text1": "Технології",
                "text2": "Перш, ніж потрапити до вас у будинок, текстильна продукція Balak Home проходить тривалий шлях від вибору кращих матеріалів для пошиття до упаковки готових виробів."
            }
        },
        "vacancies": {
            "text1": "Вакансії",
            "text2": "Зацікавились?",
            "text3": "Якщо ви зацікавились в співпраці з ТЕП ви можете зв’язатись з нами з вашою пропозицією.",
            "text4": "Залишити заявку",
            "text5": "По даному запиту вакансій не знайдено",
            "vacancyInfo": {
                "text1": "Опис",
                "text2": "Про компанію",
                "text3": "Залишити заявку"
            }
        }
    },
    "goods": {
        "text1": "Зручна постільна білизна для кращого сну",
        "text2": "Отримайте необхідний комфорт разом з м’якими простирадлами, ковдрами, які підходять саме вам, та подушками з правильною підтримкою. Усі вони зроблені з екологічних і якісних матеріалів, таких як органічно чиста бавовна, тому ви можете повністю їм довіритись.",
        "text3": "Оновлення постільної білизни без шкоди гаманцю",
        "text4": "Затишні пледи, постільна білизна у свіжих нових дизайнах, ергономічні подушки та багато іншого, що допоможе вам добре висипатись та прокидатися сповненими енергії. А їх ціни не змусять вас не спати ночами.",
        "breadcrumbs": {
          "main": "Головна",
          "goods": "Товари",
          "interior": "Фото в інтер’єрі",
          "pillows": "Подушки",
          "blankets": "Ковдри",
          "covered": "Покривала",
          "linens": "Постільна білизна",
          "toppers": "Наматрацники",
          "sheets": "Простирадла"
        },
        "comparePage": {
          "text1": "Порівняння товарів",
          "text2": "Порівняти",
          "text3": "товари",
          "text4": "змінити",
          "text5": "товара",
          "text6": "Можна замовити",
          "text7": "В наявності",
          "text8": "Немає в наявності",
          "text9": "Розміри",
          "text10": "Колір",
          "text11": "Тканина",
          "text12": "Артикул номер",
          "text13": "Ціна",
          "text14": "Ви не вибрали продуктів для порівняння",
          "text15": "Перейти до товарів"
        },
        "productPage": {
          "chooseOptionsError": "Виберіть характеристики продукту",
          "error": "Щось пішло не так"
        },
        "bigGrid": "Більше",
        "categories": "Товари",
        "productDescriptions": [
          {
            "title": "М’які, жорсткі та пухові",
            "description":
              "Обираючи ступінь жорсткості та матеріал подушки, зверніть увагу на два важливі аспекти: ваше звичне положення під час сну та вподобання. Передусім, улюблене положення допоможе звузити пошук. Наприклад, жорстка висока подушка чудово підійде людям, які полюбляють спати на боці чи спині. Ті ж, хто частіше сплять на животі, можуть обрати пласку та м’яку подушку, що забезпечує рівне положення голови, шиї та хребта для повноцінного відпочинку."
          },
          {
            "title": "Подушки з різноманітних матеріалів",
            "description":
              "Наші подушки мають чохли та наповнювачі з найрізноманітніших матеріалів, які, відповідно, мають різні властивості. Деякі з них м’які, інші повторюють контури голови, добре пропускають повітря та поглинають вологу. Уважно прочитайте опис кожної подушки, щоб обрати матеріал залежно від потреб. До того ж, ми використовуємо екологічні матеріали, які не шкодять довкіллю, щоб ви могли спати зі спокійним сумлінням."
          },
          {
            "title": "Правильний вибір",
            "description":
              "У нас ви можете знайти подушку своєї мрії. Зручна подушка забезпечує здоровий сон і хороше самопочуття. Дехто полюбляє спати на високій і м’якій подушці, водночас інші надають перевагу пласкій і жорсткій. Ми пропонуємо широкий вибір подушок на будь-який смак, щоб ви могли насолоджуватися відпочинком кожної миті."
          }
        ],
        "categoriesGrid": "Акції",
        "compareBanner": {
          "select": "обрано",
          "compare": "Порівняти товари"
        },
        "design": "Дизайни для будь-якого інтер’єру",
        "recommendedGoods": "Рекомендації для тебе",
        "interiorCard": "Більше варіантів",
        "interiorInspiration": "Більше натхнення",
        "infoDisclosure": {
          "text1": "Інформація про товар",
          "text2": "Розмірна сітка",
          "text3": "Відгуки",
          "text4": "Матеріали та догляд",
          "text5": "Екологія та довкілля",
          "text6": "Упаковка"
        },
        "interiorLook": "Вигляд в інтер’єрі",
        "paymentDetails": {
          "text1": "Колір",
          "text2": "Розмір",
          "text3": "Оберіть колір",
          "text4": "Оберіть розмір",
          "text5": "Оберіть варіант",
          "text6": "Додати до кошика",
          "text7": "Додано до кошика",
          "text8": "Ваша пошта",
          "text9": "Повідомити про наявність",
          "text10": "Додати в список покупок",
          "text11": "В наявності",
          "text12": "Немає в наявності",
          "text13": "Доставка з трекінгом",
          "text14": "Гарантія якості",
          "text15": "Служба підтримки"
        },
        "price": "грн",
        "similarGoods": "Подібні товари"
    },
    "sales": {
      "text1": "Акції",
      "text2": "Більше акційних товарів"
    },
    "info_for_buyers": {
      "text1": "Інформація для покупців",
      "text2": "ТЕП — це значно більше, ніж компанія з роздрібних продажів виробів з текстилю. Це багатогранний бренд, що характеризується використанням екологічних та сучасних матеріалів, таких як бавовна, стійкою позицією щодо прав людини, комфортними умовами роботи та демократичним дизайном своїх виробів.",
      "info_links": [
        "Зв’яжись з нами",
        "Повернення товару ",
        "Питання та відповіді",
        "Відстежити замовлення",
        "Догляд за продукцією",
        "Відгуки",
        "Умови користування",
        "Політика конфіденційності"
      ],
      "servicesLinks": [
        "Відстежити замовлення",
        "Послуги доставки",
        "Подарункові картки"
      ],
      "breadcrumbs": {
        "home": "Головна",
        "infoForBuyers": "Інформація для покупців",
        "contactUs": "Зв’яжись з нами",
        "leaveRequest": "Залишити заявку",
        "productReturn": "Повернення товару",
        "questionsAndAnswers": "Питання та відповіді",
        "care": "Догляд за продукцією",
        "feedbacks": "Відгуки",
        "leaveFeedback": "Залишити відгук"
      },
      "carePage": {
        "text1": "Догляд за продукцією",
        "text2": "Догляд",
        "text3": "Сон займає близько третини тривалості життя людини. Ваше ліжко – це храм домашнього спокою, і щоб цей храм був гармонійний, дарував якісний відпочинок та лише примножував здоров'я, а не відбавляв його, варто знати як правильно підтримувати гігієну домашнього текстилю. Оскільки різноманіття тканин та наповнювачів велике, можна легко заплутатись. Ми створили цей гайд, щоб допомогти вам зорієнтуватися в темі догляду та зрозуміти, що все не так складно, як може здаватись, на перший погляд!",
        "text4": "Правила догляду",
        "text5": "З’явились запитання?"
      },
      "contactUsPage": {
        "text1": "Зв’яжись з нами",
        "text2": "Телефон",
        "text3": "Бажаєш почути голос на іншому кінці слухавки? Ми допоможемо тобі у будь-якій справі.",
        "text4": "Телефонуй",
        "text5": "+38 (044) 391-00-00",
        "text6": "Вартість дзвінків згідно з тарифами твого оператора",
        "text7": "Понеділок – П'ятниця",
        "text8": "09:00 - 18:00",
        "text9": "Електронна пошта",
        "text10": "Якщо тобі знадобиться допомога, напиши нам електронного листа у будь-яку пору доби, і ми відповімо за першої ж нагоди.",
        "text11": "Або напиши нам листа на адресу",
        "text12": "info@tep.ua",
        "text13": "Залишити заявку"
      },
      "feedbacksPage": {
        "title": "Відгуки",
        "leaveFeedback": "Залишити відгук"
      },
      "feedbackSuccessPage": {
        "title": "Дякуємо за відгук!",
        "description": "Ви можете побачити його в списку відгуків, а також переглянути відгуки інших клієнтів.",
        "buttonTitle": "Перейти до відгуків"
      },
      "productReturnPage": {
        "text1": "Повернення товару",
        "text2": "Повернення",
        "text3": "Іноді ти можеш змінити думку. У тебе є 20 днів, щоб повернути товар. Зберігай чек, який підтверджує покупку.",
        "text4": "Політика повернення товарів",
        "text5": "Акт (заява) на повернення",
        "text6": "З’явились запитання?"
      },
      "qaCategoryPage": "Наявність товару",
      "qaa_categories": [
        {
          "id": 1,
          "topic": "Наявність товару",
          "data": [
            {
              "question":
                "Товар, який мене цікавить, був доступний онлайн, але пізніше його не виявилося в магазині. Чому так сталося?",
              "answer": [
                "Ми пропонуємо нашим клієнтам асортимент із 1000 стильних, функціональних і доступних за ціною виробів ТЕП для облаштування вашої спальної кімнати. Приблизно 200 з них можна придбати в магазині, а решту  виробів — переважно оптові товари можна замовити з доставкою до одного з наших пунктів видачі, —oдин із яких знаходиться просто в магазині, або додому за окрему плату.",
                "Хоча ми намагаємося вчасно оновлювати інформацію про наявність товару на сайті, трапляється, що з моменту перевірки наявності товару онлайн і до прибуття у магазин виріб стає недоступним. Ми докладаємо зусиль, щоб підтримувати наявну кількість товарів відповідно до потреб споживачів, але у зв’язку з пандемією COVID 19, ми можемо зіткнутися з труднощами під час закупівлі та доставки товарів від постачальників."
              ]
            },
            {
              "question": "Як перевірити наявність товару?",
              "answer": ["Як перевірити наявність товару?"]
            },
            {
              "question": "Яку гарантію на придбані вироби ви пропонуєте?",
              "answer": ["Яку гарантію на придбані вироби ви пропонуєте?"]
            },
            {
              "question": "Чи можна придбати товари ТЕП за кордоном?",
              "answer": ["Чи можна придбати товари ТЕП за кордоном?"]
            },
            {
              "question": "Як дізнатися, коли товар знову надійде у продаж?",
              "answer": ["Як дізнатися, коли товар знову надійде у продаж?"]
            },
            {
              "question": "Що якщо товар приїхав пошкодженим?",
              "answer": ["Що якщо товар приїхав пошкодженим?"]
            },
            {
              "question": "Коли певні товари знову надійдуть у продаж?",
              "answer": ["Коли певні товари знову надійдуть у продаж?"]
            },
            {
              "question": "Де можна знайти інформацію про товар онлайн?",
              "answer": ["Де можна знайти інформацію про товар онлайн?"]
            },
            {
              "question": "Коли можна очікувати нові знижки на певні товари?",
              "answer": ["Коли можна очікувати нові знижки на певні товари?"]
            }
          ]
        },
        {
          "id": 2,
          "topic": "Магазини ТЕП"
        },
        {
          "id": 3,
          "topic": "Поширені запитання",
          "data": [
            {
              "question": "Question 1",
              "answer": ["Answer 1"]
            },
            {
              "question": "Question 2",
              "answer": ["Answer 2"]
            },
            {
              "question": "Question 3",
              "answer": ["Answer 3"]
            }
          ]
        },
        {
          "id": 4,
          "topic": "Оплата",
          "data": [
            {
              "question": "Question 1",
              "answer": ["Answer 1"]
            }
          ]
        },
        {
          "id": 5,
          "topic": "Доставка"
        },
        {
          "id": 6,
          "topic": "Як відстежити замовлення"
        },
        {
          "id": 7,
          "topic": "Загальна інформація",
          "data": [
            {
              "question": "Question 1",
              "answer": ["Answer 1"]
            },
            {
              "question": "Question 2",
              "answer": ["Answer 2"]
            },
            {
              "question": "Question 3",
              "answer": ["Answer 3"]
            }
          ]
        },
        {
          "id": 8,
          "topic": "Повернення та обмін",
          "data": [
            {
              "question": "Question 1",
              "answer": ["Answer 1"]
            },
            {
              "question": "Question 2",
              "answer": ["Answer 2"]
            }
          ]
        }
      ],
      "qaaCategoriesTitle": "Питання та відповіді",
      "qaaCardText": "Більше"
    },
    "inspiration": {
      "breadcrumbs": {
        "home": "Головна",
        "inspiration": "Натхнення"
      },
      "inspirationPageTitle": "Натхнення"
    },
    "novelty": {
      "breadcrumbs": {
        "home": "Головна",
        "novelty": "Новинки"
      },
      "noveltyPage": {
        "title": "Новинки",
        "description": "Привіт, подушки! Привіт, комфорт! Квадратні, прямокутні або подушки циліндричної форми — всі вони забезпечують оптимальну підтримку вашого тіла. Покладіть їх на диван, крісло або ліжко — і кімната одразу набуде стильного вигляду. Ознайомтесь з нашим широким асортиментом подушок різних кольорів і з різними візерунками та деталями, такими як китиці і ґудзики."
      },
      "newGoodsTitle": "Нові товари"
    },
    "privacy_policy": {
      "title": "Договір публічної оферти",
      "data": [
        {
          "title": "Загальні положення",
          "clauses": [
            "1.1. Справжня оферта є офіційною пропозицією ТМ «ТЕП», далі за текстом - «Продавець», укласти Договір купівлі-продажу товарів дистанційним способом, тобто через Інтернет-магазин, далі по тексту - «Договір», і розміщує Публічну оферту (пропозицію) на офіційному інтернет-сайті Продавця «https://tep.ua (далі - Інтернет-сайт).",
            "1.2. Моментом повного і безумовного прийняття Покупцем пропозиції Продавця (акцептом) укласти електронний договір купівлі-продажу товарів, вважається факт оплати Покупцем замовлення на умовах цього Договору, у строки та за цінами, вказаними на Інтернет-сайті Продавця."
          ]
        },
        {
          "title": "Поняття і визначення",
          "clauses": [
            "2.1. У цій оферті, якщо контекст не вимагає іншого, наведені нижче терміни мають таке значення:",
            "*«Товар» - предмет торгівлі (виріб, модель, аксесуар, комплектуючі та супутні предмети, будь-які інші предмети торгівлі) продавця.",
            "* «Інтернет-магазин» - відповідно до Закону України «про електронну комерцію», засіб для подання або реалізації товару, роботи або послуги шляхом здійснення електронної угоди.",
            "* «Продавець» - компанія, яка реалізує товари, представлені на Інтернет-сайті.",
            "* «Покупець» - фізична особа, що уклала з Продавцем Договір на умовах, викладених нижче.",
            "* «Замовлення» - вибір окремих позицій з переліку товарів, зазначених Покупцем при розміщенні замовлення і проведенні оплати."
          ]
        },
        {
          "title": "Предмет договору",
          "clauses": [
            "3.1. Продавець зобов'язується передати у власність Покупця Товар, а Покупець зобов'язується оплатити і прийняти Товар на умовах даного Договору.",
            "Цей Договір регулює купівлю-продаж товарів в Інтернет-магазині, в тому числі:",
            "- добровільний вибір Покупцем товарів в Інтернет-магазині;",
            "- самостійне оформлення Покупцем замовлення в Інтернет-магазині;",
            "- оплата Покупцем замовлення, оформленого в Інтернет-магазині;",
            "- обробка та доставка замовлення Покупцеві у власність на умовах цього Договору."
          ]
        },
        {
          "title": "Порядок оформлення замовлення",
          "clauses": [
            "4.1.Покупець має право оформити замовлення на будь-який товар, представлений на Сайті Інтернет-магазину і наявний.",
            "4.2.Кожна позиція може бути представлена ​​в замовленні в будь-якій кількості.",
            "4.3. При відсутності товару на складі, Менеджер компанії зобов'язаний поставити Покупця до відома (по телефону або через електронну пошту).",
            "4.4. При відсутності товару Покупець має право замінити його товаром аналогічної моделі, відмовитися від даного товару, анулювати замовлення."
          ]
        },
        {
          "title": "Умови доставки товару",
          "clauses": [
            "5.1 Покупець отримує Товар за допомогою доставки, або отримує його особисто. Порядок оплати і отримання зазначений на відповідній сторінці Веб-сайту https://tep.ua/",
            "5.2. При доставці Товарів в інші міста України або на території іншої країни, виконуваної іншими Службами доставки (далі Компаніями-перевізниками) Покупець в повному обсязі і беззастережно погоджується з Правилами перевезення вантажів цими компаніями-перевізниками.",
            "5.3. Факт отримання Товару та відсутність претензій до якості Товару, що доставляється Компаніями-перевізниками, Покупець підтверджує власним підписом в товаротранспортній накладній, декларації Компанії-перевізника, або у видатковій накладній при отриманні Товару. Зі свого боку, Продавець гарантує відвантаження Товару Компанії-перевізнику в кількості, зазначеній і сплаченому Покупцем, в комплектності згідно специфікації цього Товару та в належному стані і якості.",
            "5.4. У разі відсутності Покупця за адресою доставки, зазначеної Покупцем в заявці або відмови Покупця від отримання Товару по необґрунтованих причинах, при доставці Кур'єром компанії-перевізника, Товар повертається в центр відвантаження. Оплата за послуги Компанії-перевізника віднімається від суми, перерахованої Покупцем за Товар. Залишок суми повертається Покупцю на підставі його листа із зазначенням розрахункового рахунку, на який повинні бути повернені кошти.",
            "Всі питання, що виникли в процесі оплати та отримання Товару, Покупець може з'ясувати за контактними даними в розділі Контакти."
          ]
        },
        {
          "title": "Права та обов'язки сторін:",
          "clauses": [
            "6.1. Продавець має право:",
            "- в односторонньому порядку припинити надання послуг за цим договором у разі порушення Покупцем умов цього договору.",
            "6.2. Покупець зобов'язаний:",
            "- своєчасно оплатити та отримати замовлення на умовах цього договору.",
            "6.3. Покупець має право:",
            "- оформити замовлення в Інтернет-магазині;",
            "- оформити електронний договір;",
            "- вимагати від Продавця виконання умов цього Договору."
          ]
        },
        {
          "title": "Відповідальність сторін",
          "clauses": [
            "7.1. Сторони несуть відповідальність за невиконання або неналежне виконання умов цього договору в порядку, передбаченому цим договором та чинним законодавством України.",
            "7.2. Продавець не несе відповідальності за:",
            "- змінений виробником зовнішній вигляд Товару;",
            "- за незначну невідповідність кольорової гами товару, що може відрізнятися від оригіналу товару виключно через різній колірній передачі моніторів персональних комп'ютерів окремих моделей;",
            "- за зміст і правдивість інформації, наданої Покупцем при оформленні замовлення;",
            "- за затримку і перебої в наданні Послуг (обробки замовлення та доставки товару), які відбуваються з причин, що знаходяться поза сферою його контролю;",
            "-за протиправні незаконні дії, здійснені Покупцем за допомогою даного доступу до мережі Інтернет;",
            "- за передачу Покупцем своїх мережевих ідентифікаторів - IP, MAC-адреси, логіна і пароля третім особам;",
            "7.3. Покупець, використовуючи наданий йому доступ до мережі Інтернет, самостійно несе відповідальність за шкоду, заподіяну його діями (особисто, навіть якщо під його логіном знаходилась інша особа) особам або їх майну, юридичним особам, державі чи моральним принципам моральності.",
            "7.4. У разі настання обставин непереборної сили, сторони звільняються від виконання умов цього договору. Під обставинами непереборної сили для цілей цього договору розуміються події, що мають надзвичайний, непередбачений характер, які виключають або об'єктивно заважають виконанню цього договору, настання яких Сторони не могли передбачити і запобігти розумними способами.",
            "7.5.Сторони прикладають максимум зусиль для вирішення будь-яких розбіжностей виключно шляхом переговорів."
          ]
        },
        {
          "title": "Інші умови",
          "clauses": [
            "8.1. Інтернет-магазин залишає за собою право в односторонньому порядку вносити зміни до цього договору за умови попередньої публікації його на сайті https://tep.ua",
            "8.2. Інтернет-магазин створений для організації дистанційного способу продажу товарів через Інтернет.",
            "8.3. Покупець несе відповідальність за достовірність інформації, зазначеної при оформленні замовлення інформації. При цьому, при здійсненні акцепту (оформленні замовлення і подальшої оплати товару) Покупець надає Продавцю свою беззастережну згоду на збір, обробку, зберігання, використання своїх персональних даних, в розумінні ЗУ «Про захист персональних даних».",
            "8.4. Оплата Покупцем оформленого в Інтернет-магазині замовлення означає повну згоду Покупця з умовами договору купівлі-продажу (публічної оферти)",
            "8.5. Фактичною датою електронної угоди між сторонами є дата прийняття умов, відповідно до ст. 11 Закону України «Про електронну комерцію»",
            "8.6. Використання ресурсу Інтернет-магазину для попереднього перегляду товару, а також для оформлення замовлення для Покупця є безкоштовним.",
            "8.7. Інформація, яка надається Покупцем, є конфіденційною. Інтернет-магазин використовує інформацію про Покупця виключно в цілях обробки замовлення, відправлення повідомлень Покупцеві, доставки товару, здійснення взаєморозрахунків і ін."
          ]
        },
        {
          "title": "Порядок повернення товару належної якості",
          "clauses": [
            "9.1. Повернення товару в Інтернет-магазин проводиться згідно чинного законодавства України.",
            "9.2. Повернення товару в Інтернет-магазин проводиться за рахунок Покупця.",
            "9.3. При поверненні Покупцем товару належної якості, Інтернет-магазин повертає йому сплачену за товар грошову суму за фактом повернення товару за вирахуванням компенсації витрат Інтернет-магазину пов'язаних з доставкою товару Покупцеві."
          ]
        },
        {
          "title": "Термін дії договору",
          "clauses": [
            "10.1. Електронний договір вважається укладеним з моменту одержання особою, яка направила пропозицію укласти такий договір, відповіді про прийняття цієї пропозиції в порядку, визначеному частиною шостою статті 11 Закону України \"Про електронну комерцію\".",
            "10.2. До закінчення терміну дії цей Договір може бути розірваний за взаємною згодою сторін до моменту фактичної доставки товару, шляхом повернення грошових коштів",
            "10.3. Сторони мають право розірвати цей договір в односторонньому порядку, в разі невиконання однією із сторін умов цього Договору та у випадках, передбачених чинним законодавством України."
          ]
        }
      ]
    },
    "purchase": {
      "layoutTitle": "Оформлення покупки",
      "stages": [
        "Адреса",
        "Доставка",
        "Дані замовлення",
        "Оплата замовлення",
        "Підтвердження замовлення"
      ],
      "addressTitle": "Адреса замовника",
      "addressForm": {
        "text1": "Ім’я",
        "text2": "Ваше ім’я",
        "text3": "Прізвище",
        "text4": "Ваше прізвище",
        "text5": "Адреса",
        "text6": "Ваша адреса",
        "text7": "Місто",
        "text8": "Ваше місто",
        "text9": "Область",
        "text10": "Ваша область",
        "text11": "Індекс",
        "text12": "Ваш індекс",
        "text13": "Телефон",
        "text14": "Ваш телефон",
        "text15": "Електронна пошта",
        "text16": "Ваша пошта",
        "text17": "Зберегти та продовжити"
      },
      "confirmation": {
        "text1": "Замовлення оформлено",
        "text2": "Ваше замовлення успішно оформлене! Очікуйте новин щодо доставки. Ви можете відсліткувати статус Вашого замовлення завдяки трекінг-номеру у розділі “Відтежити замовлення”",
        "text3": "Відстежити замовлення",
        "text4": "На головну"
      },
      "deliveryTitle": "Доставка",
      "deliveryForm": {
        "text1": "Служба доставки",
        "text2": "Оберіть службу",
        "text3": "Укр Пошта",
        "text4": "Нова Пошта",
        "text5": "Спосіб доставки",
        "text6": "Оберіть спосіб",
        "text7": "Відділення Нової пошти",
        "text8": "Відділення Укр пошти",
        "text9": "Кур’єр Нової Пошти",
        "text10": "Кур’єр Укр Пошти",
        "text11": "Номер відділення",
        "text12": "Оберіть номер відділення",
        "text13": "Адреса",
        "text14": "Ваша адреса",
        "text15": "Зберегти та продовжити"
      },
      "orderData": {
        "title": "Дані замовлення",
        "deleteButton": "Видалити всі товари",
        "saveButton": "Зберегти та продовжити"
      },
      "paymentTitle": "Оплата замовлення",
      "paymentForm": {
        "text1": "Споіб оплати",
        "text2": "Оберіть спосіб оплати",
        "text3": "Оплата картою он-лайн",
        "text4": "Оплата при доставці",
        "text5": "Номер банківської картки",
        "text6": "мм/рр",
        "text7": "Дійсний до",
        "text8": "CVV/CVC2 - це код безпеки вашої картки. Це три останні цифри в полі підпису на зворотному боці Вашої картки.",
        "text9": "Додати картку до шаблану",
        "text10": "Промокод*",
        "text11": "Ваш промокод",
        "text12": "Коментар до замовлення*",
        "text13": "Ваш коментар",
        "text14": "Оплатити та продовжити"
      },
      "promocode": {
        "text1": "Отакої!",
        "text2": "Вітаємо! Ви набрали більше",
        "text3": "10 тис грн.",
        "text4": "Отримайте",
        "text5": "на наступну покупку!",
        "text6": "Ваша пошта",
        "text7": "Отримати промокод"
      },
      "wholesale10k": {
        "title": "Режим оптової закупівлі",
        "description": "Ви набрали товар на суму більше 10 000 гривень, тому ви перейшли в режим оптової закупівлі. Ви оптовий покупець?",
        "yes": "Так",
        "no": "Ні"
      },
      "wholesale100k": {
        "title": "Режим оптової закупівлі",
        "description": "Ви набрали товар на суму більше 100 000 гривень, тому ви автоматично перейшли в режим оптової закупівлі. Ціни на сайті було оновлено згідно з умов оптової купівлі товару.",
        "accept": "Добре"
      }
    },
    "search": {
      "searchPage": {
        "found": "Результати пошуку для",
        "notfound": "Ми не знайшли збігів для",
        "question": "Малось на увазі?",
        "title": "З цим товаром також шукають"
      },
      "breadcrumbs": {
        "home": "Головна",
        "search": "Результати пошуку"
      }
    },
    "services": {
      "breadcrumbs": {
        "home": "Головна",
        "services": "Послуги",
        "gifts": "Подарункові картки",
        "delivery": "Послуги доставки"
      },
      "deliveryPage": {
        "text1": "Послуги доставки",
        "text2": "Про послуги",
        "text3": "Доставка по Україні здійснюється транспортними компаніями Нова Пошта та Укрпошта.",
        "text4": "Послуги за доставку замовлення сплачує покупець, згідно з тарифами компанії перевізника.",
        "text5": "Відправлення товару відбувається протягом 1-3 робочих днів з мoменту оформлення замовлення.",
        "text6": "Доставка замовлення займає від 1-3 робочих днів при виборі доставки у відділення компаніі перевізника, та до 5 робочих днів - при замовленні кур'єрської доставки транспортної компанії. З нашого боку ми зробимо усе можливе, щоб доставити ваше замовлення якнайшвидше.",
        "text7": "Якщо загальна вартість замовлення складає 3500 грн, доставкадо відділення Нової пошти та Укрпошти здійснюється безкоштовно (за умови повної оплати замовлення)."
      },
      "giftsPage": {
        "text1": "Подарункові картки",
        "text2": "Вже маєш подарункову картку?",
        "text3": "- На картку можна зарахувати будь-яку суму від 100 до 15000 гривень.",
        "text4": "- Карткою можна користуватися поки вся сума не буде витрачена.",
        "text5": "- Термін придатності подарункової картки становить 3 роки.",
        "text6": "- ТЕП не може замінити втрачену або викрадену картку.",
        "text7": "- Кошти за товари, оплачені подарунковою картою, повертаються виключно на карту відшкодування ТЕП.",
        "text8": "- Подарункову карту можна використаи виключно у фізичному магазині ТЕП на території України.",
        "text9": "- Подарункова карта не підлягає поверненню."
      },
      "tracking": {
        "title": "Відстежити замовлення",
        "description": "Хочеш дізнатися, де зараз товари, що ти замовив? Послуга &quot;Відстежити замовлення&quot; тобі в цьому допоможе! Для відстеження твого замовлення у полі &apos;Номер замовлення&apos; введи номер свого замовлення, вказаний у листі (напр. SO123456)",
        "leaveFeedback": "Залишити відгук"
      },
      "trackingForm": {
        "label": "Номер замовлення",
        "placeholder": "Ваш номер",
        "button": "Відстежити"
      },
      "novaPost": {
        "text1": "Вартість послуг доставки:",
        "text2": "Замовлення до 15 кг та певних розмірів*:",
        "text3": "Доставка до дверей твого дому",
        "text4": "Звичайний час доставки становить від 1 до 5 днів",
        "text5": "З понеділка по суботу з 8:00 до 17:00",
        "text6": "Зона доставки №1 (Київ та Київська область) - 99 грн",
        "text7": "Зона доставки №2 - 149 грн",
        "text8": "Зона доставки №3 - 199 грн",
        "text9": "Зона доставки №4 - 299 грн",
        "text10": "Замовлення від 15 до 30 кг та певних розмірів*:",
        "text11": "Доставка до дверей твого дому",
        "text12": "Звичайний час доставки становить від 1 до 5 днів",
        "text13": "З понеділка по суботу з 8:00 до 17:00",
        "text14": "Зона доставки №1 (Київ та Київська область) - 149 грн",
        "text15": "Зона доставки №2 - 299 грн",
        "text16": "Зона доставки №3 - 399 грн",
        "text17": "Зона доставки №4 - 499 грн",
        "text18": "Замовлення більше 30кг",
        "text19": "Доставка до обраної кімнати**, вдома або на роботі",
        "text20": "Дата та час доставки на твій вибір",
        "text21": "Доставка здійснюється з понеділка по суботу з 8:00 до 17:00",
        "text22": "Ціна в межах міста Києва 699 грн",
        "text23": "Ціна за межами Києва 1599 грн",
        "text24": "Кожна додаткова тонна оплачується за ціною повної доставки",
        "text25": "Відстежити замовлення"
      },
      "ukrPost": {
        "text1": "Вартість послуг доставки:",
        "text2": "Доставка «Укрпошта Стандарт»:",
        "text3": "- у відділення — від 25 грн.",
        "text4": "- адресна доставка кур'єром — від 50 грн.",
        "text5": "Доставка «Укрпошта Експрес»:",
        "text6": "-  у відділення - від 35 грн.",
        "text7": "- адресна доставка курʼєром - від 65 грн.",
        "text8": "Відстежити замовлення"
      },
      "aboutGiftCards": {
        "title": "Про картки",
        "description": "Ми пропонуємо покупцям сотні товарів, тому вибрати найкращий з них може бути складно. З подарунковою карткою ТЕП ти даруєш подарунок, який дорога людина може обрати сама. Ми пропонуємо покупцям сотні товарів, тому вибрати найкращий з них може бути складно. З подарунковою карткою ТЕП ти даруєш подарунок, який дорога людина може обрати сама.",
        "cardsDescriptions": [
          "Ви можете придбати у нас подарункову картку, в якості подарунку на будь-яке свято чи святкову подію.",
          "Ви можете придбати у нас подарункову картку, в якості подарунку на будь-яке свято чи святкову подію.",
          "Ви можете придбати у нас подарункову картку, в якості подарунку на будь-яке свято чи святкову подію."
        ]
      },
      "giftCard": {
        "text1": "Картка на",
        "text2": "грн"
      },
      "wantToBuy": {
        "title": "Бажаєш придбати подарункову картку?",
        "description": "Зробити це дуже легко - відвідай магазин ТЕП, щоб придбати подарункову картку або замовляй он-лайн!",
        "button": "Замовити"
      }
    },
    "common": {
      "autocompleteInput": {
        "text1": "Артикул №",
        "text2": "Всі товари"
      },
      "anyQuestions": {
        "title": "Залишились питання?",
        "description": "Якщо тобі потрібно терміново щось нам повідомити, зв'яжись з нами зручним способом.",
        "buttonText": "Зв’яжись з нами"
      },
      "authNotificationMessage": "Ви успішно авторизувались на",
      "banner": {
        "title": "Шановні покупці!",
        "description": "Під час карантину ми залишаємось доступними для вас 24/7. Замовляйте товари в інтернет-магазині та забирайте у пунктах видачі біля свого дому. Пункти видачі замовлень на пошті продовжують працювати у звичайному режимі. Дізнатися, як забрати своє замовлення можна за посиланням. Потрібного товару немає в наявності? Звернись за консультацією онлайн! Пиши на адресу support.tep@gmail.com"
      },
      "cartNotification": {
        "message": "було додано у твій кошик",
        "link": "Переглянути"
      },
      "favNotification": {
        "message": "було збережено до улюбленого",
        "link": "Переглянути"
      },
      "tipCurrency": "грн"
    },
    "filters": {
      "vacancyFilter": {
        "text1": "Вакансія",
        "text2": "Сфера роботи",
        "text3": "Тип зайнятості",
        "text4": "Область",
        "text5": "Місто",
        "text6": "Фільтр",
        "text7": "знайдено",
        "text8": "Вид роботи",
        "text9": "Ваша область",
        "text10": "Ваше місто"
      },
      "skeleton": {
        "title": "Фільтр та сортування",
        "clear": "Очистити все",
        "view": "Переглянути"
      },
      "searchFilter": {
        "text1": "Сортувати",
        "text2": "Розмір",
        "text3": "Колір",
        "text4": "Тканина",
        "text5": "Всі фільтри",
        "text6": "товара",
        "text7": "Найкраще підходять",
        "text8": "Ціна: від низької до високої",
        "text9": "Ціна: від високої до низької",
        "text10": "Новинка",
        "text11": "Назва",
        "text12": "Найпопулярніше",
        "text13": "Матеріал"
      },
      "productsFilter": {
        "text1": "Порівняти",
        "text2": "Сортувати",
        "text3": "Розмір",
        "text4": "Всі фільтри",
        "text5": "товара",
        "text6": "Найкраще підходять",
        "text7": "Ціна: від низької до високої",
        "text8": "Ціна: від високої до низької",
        "text9": "Новинка",
        "text10": "Назва",
        "text11": "Найпопулярніше"
      },
      "feedbacksFilterAll": "Всі",
      "categoriesFilterAll": "Всі"
    },
    "header": {
      "companyBaseInfo": {
        "title": "Компанія",
        "description": "Раді вітати Вас у ТЕП"
      },
      "companyLinks": [
        {
          "title": "Про бренд ТЕП",
          "description": "Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог ..."
        },
        {
          "title": "Співпраця та партнерство",
          "description": "Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог ..."
        },
        {
          "title": "Робота в ТЕП",
          "description": "Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог ..."
        },
        {
          "title": "Технології",
          "description": "Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог ..."
        },
        {
          "title": "Блог",
          "description": "Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог ..."
        }
      ],
      "companyLabel": "Компанія",
      "goodsBaseInfo": {
        "title": "Продукти",
        "description": "Раді вітати Вас у ТЕП"
      },
      "goodsLabel": "Товари",
      "salesTitle": "Акції",
      "salesDescription": "Квадратні, прямокутні або подушки циліндричної форми — всі вони забезпечують оптимальну підтримку вашого тіла.",
      "headerButton": "Відкрити меню",
      "infoBaseInfo": {
        "title": "ТЕП",
        "description": "Раді вітати Вас у ТЕП"
      },
      "infoLinks": [
        {
          "title": "Питання та відповіді",
          "description": "Тут ви зможете знайти усі відповіді на запитання або ж задати своє персоналізоване запитання ... "
        },
        {
          "title": "Повернення товару",
          "description": "Тут ви зможете знайти усі відповіді на запитання або ж задати своє персоналізоване запитання ... "
        },
        {
          "title": "Зв’язатись з нами",
          "description": "Тут ви зможете знайти усі відповіді на запитання або ж задати своє персоналізоване запитання ... "
        },
        {
          "title": "Ваші відгуки",
          "description": "Тут ви зможете знайти усі відповіді на запитання або ж задати своє персоналізоване запитання ... "
        },
        {
          "title": "Догляд",
          "description": "Тут ви зможете знайти усі відповіді на запитання або ж задати своє персоналізоване запитання ... "
        }
      ],
      "infoLabel": "Інформація для покупців",
      "serviceBaseInfo": {
        "title": "ТЕП",
        "description": "Раді вітати Вас у ТЕП"
      },
      "serviceLinks": [
        {
          "title": "Подарункові картки",
          "description": "Ви можете придбати у нас подарункові карти, в якості подарунку на будь-яке ... "
        },
        {
          "title": "Послуги доставки",
          "description": "Ви можете придбати у нас подарункові карти, в якості подарунку на будь-яке ... "
        },
        {
          "title": "Відстежити замовлення",
          "description": "Ви можете придбати у нас подарункові карти, в якості подарунку на будь-яке ... "
        }
      ],
      "serviceLabel": "Послуги"
    },
    "footer": {
      "address": "Чернівці, вул. Комунальників 4Б",
      "credentials": "© ТЕП Україна 2021",
      "termsOfUse": "Умови користування",
      "policyPrivacy": "Політика конфіденційності",
      "companyLinks": [
        "Про бренд ТЕП",
        "Співпраця та партнерство",
        "Робота в ТЕП",
        "Магазини ТЕП",
        "Технології",
        "Блог"
      ],
      "servicesLinks": [
        "Відстежити замовлення",
        "Послуги доставки",
        "Подарункові картки"
      ],
      "infoLinks": [
        "Питання та відповіді",
        "Інформація для покупців",
        "Повернення товару",
        "Зв’язатись з нами",
        "Відгуки",
        "Догляд"
      ]
    },
    "forms": {
      "emailError": "Не коректна адреса електронної пошти",
      "passwordLengthError": "Пароль повинен містити хоча б 8 символів",
      "ratingError": "Оцініть товар від 1 до 5",
      "categoryError": "Оберіть категорію",
      "productError": "Оберіть товар",
      "firstNameError": "Обов'язково вкажіть ім'я",
      "lastNameError": "Обов'язково вкажіть прізвище",
      "streetError": "Обов'язково вкажіть вулицю",
      "cityError": "Обов'язково вкажіть місто",
      "regionError": "Обов'язково вкажіть область",
      "postalError": "Обов'язково вкажіть індекс",
      "deliveryServiceError": "Обовязково вкажіть службу доставки",
      "deliveryMethodError": "Обовязково вкажіть метод доставки",
      "departmentError": "Обовязково вкажіть номер відділення",
      "paymentError": "Обовязково оберіть спосіб оплати",
      "orderNumberError": "Номер замовлення не коректний. Перевірте будь ласка введені дані.",
      "contactUsRequestForm": {
        "text1": "Залишити заявку",
        "text2": "Ім’я",
        "text3": "Тарас Шевченко",
        "text4": "Пошта",
        "text5": "Телефон",
        "text6": "Спосіб зв'язку",
        "text7": "Обрати",
        "text8": "За номером телефону",
        "text9": "Електронною поштою",
        "text10": "Повідомлення *",
        "text11": "Не обов’язково *",
        "text12": "Надіслати",
      },
      "cooperationRequestForm": {
        "text1": "Залишити заявку",
        "text2": "Ім’я",
        "text3": "Тарас Шевченко",
        "text4": "Пошта",
        "text5": "Телефон",
        "text6": "Повідомлення *",
        "text7": "Не обов’язково *",
        "text8": "Надіслати"
      },
      "feedbackForm": {
        "text1": "Залишити відгук",
        "text2": "Оцінка",
        "text3": "Повідомлення *",
        "text4": "Не обов’язково *",
        "text5": "Файли",
        "text6": "Надіслати"
      },
      "categoriesFormSelect": {
        "label": "Категорія",
        "display": "Обрати категорію"
      },
      "productsFormSelect": {
        "label": "Товари",
        "display": "Оберіть товар"
      },
      "getInstructionsForm": {
        "title": "Отримай PDF інструкцію по пранню ковдр в якості бонусу",
        "description": "Шукаєш внформацію по тому як правильно прати дитячі ковдри? Заповни форму та клікай завантажити, щоб отримати інструкцію! Шукаєш внформацію по тому як правильно прати дитячі ковдри? Заповни форму та клікай завантажити, щоб отримати інструкцію!",
        "nameLabel": "Ім’я",
        "nameDisplay": "Тарас Шевченко",
        "emailLabel": "Пошта",
        "button": "Завантажити"
      },
      "success": {
        "title": "Ваша заявка надіслана",
        "description": "Дякую за заявку! Наш менеджер зв’яжеться з Вами найближчим часом, щоб обговорити деталі.",
        "buttonTitle": "На головну"
      },
      "vacancyRequestForm": {
        "title": "Залишити заявку",
        "errorTitle": "Виникла помилка, спробуйте пізніше",
        "nameLabel": "Ім’я",
        "nameDisplay": "Тарас Шевченко",
        "emailLabel": "Пошта",
        "phoneLabel": "Телефон",
        "messageLabel": "Повідомлення *",
        "messageDisplay": "Не обов’язково *",
        "files": "Файли",
        "button": "Надіслати"
      }
    },
    "home": {
      "heroInfo": [
        {
          "title": "Тепло твого дому з ТЕП",
          "buttonText": "Переглянути товари"
        },
        {
          "title": "Рушники Honey - Дотик Ніжності.",
          "buttonText": "Переглянути товари"
        },
        {
          "title": "Додаток ТЕП для зручного замовлення",
          "buttonText": "Скачати"
        }
      ],
      "presentation": {
        "text1": "Акції",
        "text2": "Наші товари за акційною ціною",
        "text3": "Переглянути",
        "text4": "Товари",
        "text5": "Ознайомся з лінійкою наших товарів",
        "text6": "Ознайомитись",
        "text7": "Новинки",
        "text8": "Нові колекції та текстильні лінійки"
      },
      "usefulInfo": {
        "content": [
          {
            "title": "Послуги",
            "links": [
              { "text": "Відстежити замовлення" },
              { "text": "Послуги доставки" },
              { "text": "Подарункові картки" }
            ]
          },
          {
            "title": "Інформація для покупців",
            "links": [
              { "text": "Питання та відповіді" },
              { "text": "Інформація для покупців" },
              { "text": "Повернення товару" },
              { "text": "Зв’язатись з нами" },
              { "text": "Відгуки" },
              { "text": "Догляд" }
            ]
          }
        ],
        "title": "Корисна інформація",
        "giftCards": "Подарункові картки"
      },
      "allAboutTep": {
        "title": "Все про ТЕП",
        "infoTitle1": "Блог",
        "infoTitle2": "Співпраця з ТЕП",
        "infoTitle3": "Робота в ТЕП",
        "infoDescription1": "Тут в нас зібрані статті присвячені про роботу в ТЕП, наші товари і...",
        "infoDescription2": "В нашому магазині можна придбати товари за акційною пропозицією...",
        "infoDescription3": "Для будь-якого товару можна замовити доставку кур’єра..."
      },
      "inspirationTitle": "Натхнення",
      "moreOffers": {
        "title": "Більше пропозицій",
        "infoTitle1": "Подарункові карти",
        "infoTitle2": "Каталоги ТЕП",
        "infoTitle3": "Послуги доставки",
        "infoDescription1": "Ви можете придбати у нас подарункові карти, в якості подарунку на будь-яке...",
        "infoDescription2": "В нашому магазині можна придбати товари за акційною пропозицією...",
        "infoDescription3": "Для будь-якого товару можна замовити доставку кур’єра..."
      },
      "popularTitle": "Популярне",
      "recomendationsTitle": "Рекомендації для тебе"
    },
    "changeLanguage": {
      "title": "Змінити мову",
      "uk": "Українська",
      "ru": "Русский",
      "en": "English"
    },
    "helpButton": {
      "name": "Допомога",
      "title": "Обслуговування клієнтів",
      "greeting": "Привіт! Ви звернулись в центр обслуговування клієнтів.",
      "placeholder": "Введіть ваш запит ..."
    },
    "withColorFillingBlock": {
      "description": "ТЕП - це компанія з багаторічною історією, яка розробляє якісні текстильні товари по всій Україні...",
      "title": "Про бренд ТЕП",
      "buttonText": "Переглянути"
    },
    "notFound": {
      "title": "Сторінка не знайдена",
      "description": "Можливо, Ви вказали не існуючу адресу, сторінка була видалена, переміщена або тимчасово недоступна!",
      "buttonText": "На головну"
    }
}