export type Vacancy = {
  id: string;
  position: string;
  city: string;
  country: string;
  occupation: string;
  requirements: string[];
  description: string;
  about_company: string;
  created_at: string;
};

export const vacancies: Vacancy[] = [
  {
    id: "1",
    position: "Маркетолог",
    city: "Київ",
    country: "Україна",
    occupation: "Повна зайнятість",
    requirements: [
      "Копірайтинг",
      "Соціальні мережі",
      "Англійська мова",
      "Маркетинг",
    ],
    description:
      "Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення. Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення.",
    about_company:
      "Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення. Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення.",
    created_at: "02.04.2021",
  },
  {
    id: "2",
    position: "Сортувальник",
    city: "Київ",
    country: "Україна",
    occupation: "Повна зайнятість",
    requirements: [
      "Копірайтинг",
      "Соціальні мережі",
      "Англійська мова",
      "Маркетинг",
    ],
    description:
      "Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення. Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення.",
    about_company:
      "Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення. Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення.",
    created_at: "02.04.2021",
  },
  {
    id: "3",
    position: "Менеджер по складу",
    city: "Київ",
    country: "Україна",
    occupation: "Повна зайнятість",
    requirements: [
      "Копірайтинг",
      "Соціальні мережі",
      "Англійська мова",
      "Маркетинг",
    ],
    description:
      "Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення. Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення.",
    about_company:
      "Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення. Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення.",
    created_at: "02.04.2021",
  },
  {
    id: "4",
    position: "Бугалтер",
    city: "Київ",
    country: "Україна",
    occupation: "Повна зайнятість",
    requirements: [
      "Копірайтинг",
      "Соціальні мережі",
      "Англійська мова",
      "Маркетинг",
    ],
    description:
      "Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення. Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення.",
    about_company:
      "Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення. Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення.",
    created_at: "02.04.2021",
  },
];
