import { StaticImageData } from "next/image";
import { CompanyUrl } from "route-urls";

import { Container, Pagination, Section } from "common/ui";
import BlogGrid from "components/Company/Blog/BlogGrid";
import BlogHead from "components/Company/Blog/BlogHead";
import CareOfPillowsIMG from "components/Company/Blog/static/care-of-pillows.jpg";
import ComplexityIMG from "components/Company/Blog/static/complexity.jpg";
import ForChildrenIMG from "components/Company/Blog/static/for-children.jpg";
import WhatMaterialsIMG from "components/Company/Blog/static/materials.jpg";
import TextilesIMG from "components/Company/Blog/static/textiles-block.jpg";
import TopicIMG1 from "components/Company/Blog/static/topic-img1.jpg";
import TopicIMG2 from "components/Company/Blog/static/topic-img2.jpg";
import TopicIMG3 from "components/Company/Blog/static/topic-img3.jpg";
import TopicIMG4 from "components/Company/Blog/static/topic-img4.jpg";
import TopicIMG5 from "components/Company/Blog/static/topic-img5.jpg";
import TopicIMG6 from "components/Company/Blog/static/topic-img6.jpg";
import TopicIMG7 from "components/Company/Blog/static/topic-img7.jpg";
import TopicIMG8 from "components/Company/Blog/static/topic-img8.jpg";
import { WithColorFillingBlock } from "components/WithColorFillingBlock";

export type Article = {
  id: string;
  topic: string;
  info: {
    images: {
      topicImg: StaticImageData | string;
      complexityImg: StaticImageData | string;
      for_childrenImg: StaticImageData | string;
      what_materials: StaticImageData | string;
    };
    complexity?: {
      title: string;
      description: string;
    };
    requirements?: {
      title: string;
      description: string[];
    };
    what_materials?: {
      title: string;
      description: string[];
    };
    for_children?: {
      imageText: string;
      description: string;
    };
  };
  author: {
    name: string;
    created_at: string;
    tags: string[];
    socialLinks?: {
      instagram?: string;
      facebook?: string;
      youtube?: string;
      pinterest?: string;
      linkedin?: string;
    };
  };
};

export const articles: Article[] = [
  {
    id: "1",
    topic: "Як обрати дитячу ковдру?",
    info: {
      images: {
        topicImg: TopicIMG1,
        complexityImg: ComplexityIMG,
        for_childrenImg: ForChildrenIMG,
        what_materials: WhatMaterialsIMG,
      },
      complexity: {
        title: "В чому може бути складність?",
        description:
          "Комфортне і 'правильне' дитяче ковдру забезпечить міцний сон не тільки дитині, а й батькам. Як правильно вибрати ковдру, і на що звертати увагу розглянемо нижче.",
      },
      requirements: {
        title: "Якою має бути ковдра?",
        description: [
          "Отвечать сезону: зимнее, летнее, межсезонное или одеяло-трансформер на все сезоны.",
          "Лёгким в весе. Взрослому человеку одеяло может казаться совсем лёгким, а для ребёнка лишний вес может стать причиной беспокойного сна.",
          "Высокого качества. Материалы низкого качества уже после первой стирки могут 'сесть', потерять цвет или стать неприятными на ощупь из-за скатышей.",
          "Простое в уходе. Выбирайте износостойкие ткани, которые легко отстирываются и быстро сохнут.",
          "С высокой воздухопроницаемостью. При выборе одеяла обращайте внимание на его возможности циркуляции воздуха.",
          "Вологостійке. Ковдра має мати здатність швидко вбирати і випаровувати вологу.",
          "Звертайте увагу на тепловіддачу. Гарне ковдра повинна зберігати тепло при цьому пропускаючи повітря.",
          "Гипоаллергенное. Навіть якщо у дитини немає алергії, враховуйте цей момент, адже натуральний пух або якісь матеріали, можуть стати причиною нежиті або сльозливості вранці.",
        ],
      },
      what_materials: {
        title: "З якого матеріалу обрати ковдру?",
        description: [
          "1. Можливо, ви здивуєтеся, але можете сміливо вибирати синтетичні матеріали. Поліестер пух за своїми якостями схожий на натуральний пух, але на відміну від натурального, не викликає алергії! У Balak Home є спеціально пошиту для діток ковдру 'Kids Line' з колекції Luxe Collection з 100% бавовни з наповнювачем поліестер пух.",
          "2. Ковдра з антиалергенних поліефірних волокон. Такий наповнювач практичний в догляді і забезпечить дитині комфортний сон. У колекції Luxe Collection ви можете знайти ковдру для дітей 'Favourite' з поліефірних волокон 'Double Air' з зовнішньої тканиною 100% мікрофібра. Таке ковдру залишається легким, м'яким і повітряним навіть після багаторазового прання.",
          "Вибираючи ковдру для свого малюка або на подарунок, називайте консультанту не лише вік дитини, а й його зростання, щоб правильно підібрати відповідний розмір.",
        ],
      },
      for_children: {
        imageText:
          "Дітки часто ховаються з головою, якщо їм наснилося щось страшне, літає муха або замерзли, тому дуже важливо вибирати ковдру з високою повітропроникністю.",
        description:
          "Якщо зовнішню тканину можна розглянути, то про склад наповнювача поцікавтеся у консультанта. У дитячі ковдри до натурального пуху часто додають гусячі або качині пір'я для того, щоб додати обсяг. Такий наповнювач сильно вбирає вологу і може з часом відволожуватися, а це ідеальне середовище для появи пилових кліщів і бактерій.",
      },
    },
    author: {
      name: "Марія Балак",
      created_at: "12.04.2021",
      tags: ["постільна білизна", "діти", "ковдри", "екологічні матеріали"],
      socialLinks: {
        instagram: "#",
        facebook: "#",
        youtube: "#",
        pinterest: "#",
        linkedin: "#",
      },
    },
  },
  {
    id: "2",
    topic: "Екологічне повсякденне життя",
    info: {
      images: {
        topicImg: TopicIMG2,
        complexityImg: ComplexityIMG,
        for_childrenImg: ForChildrenIMG,
        what_materials: WhatMaterialsIMG,
      },
      complexity: {
        title: "В чому може бути складність?",
        description:
          "Комфортне і 'правильне' дитяче ковдру забезпечить міцний сон не тільки дитині, а й батькам. Як правильно вибрати ковдру, і на що звертати увагу розглянемо нижче.",
      },
      requirements: {
        title: "Якою має бути ковдра?",
        description: [
          "1. Отвечать сезону: зимнее, летнее, межсезонное или одеяло-трансформер на все сезоны.",
          "2. Лёгким в весе. Взрослому человеку одеяло может казаться совсем лёгким, а для ребёнка лишний вес может стать причиной беспокойного сна.",
          "3. Высокого качества. Материалы низкого качества уже после первой стирки могут 'сесть', потерять цвет или стать неприятными на ощупь из-за скатышей.",
          "4. Простое в уходе. Выбирайте износостойкие ткани, которые легко отстирываются и быстро сохнут.",
          "5. С высокой воздухопроницаемостью. При выборе одеяла обращайте внимание на его возможности циркуляции воздуха.",
          "6. Вологостійке. Ковдра має мати здатність швидко вбирати і випаровувати вологу.",
          "7. Звертайте увагу на тепловіддачу. Гарне ковдра повинна зберігати тепло при цьому пропускаючи повітря.",
          "8. Гипоаллергенное. Навіть якщо у дитини немає алергії, враховуйте цей момент, адже натуральний пух або якісь матеріали, можуть стати причиною нежиті або сльозливості вранці.",
        ],
      },
      what_materials: {
        title: "З якого матеріалу обрати ковдру?",
        description: [
          "1. Можливо, ви здивуєтеся, але можете сміливо вибирати синтетичні матеріали. Поліестер пух за своїми якостями схожий на натуральний пух, але на відміну від натурального, не викликає алергії! У Balak Home є спеціально пошиту для діток ковдру 'Kids Line' з колекції Luxe Collection з 100% бавовни з наповнювачем поліестер пух.",
          "2. Ковдра з антиалергенних поліефірних волокон. Такий наповнювач практичний в догляді і забезпечить дитині комфортний сон. У колекції Luxe Collection ви можете знайти ковдру для дітей 'Favourite' з поліефірних волокон 'Double Air' з зовнішньої тканиною 100% мікрофібра. Таке ковдру залишається легким, м'яким і повітряним навіть після багаторазового прання.",
          "Вибираючи ковдру для свого малюка або на подарунок, називайте консультанту не лише вік дитини, а й його зростання, щоб правильно підібрати відповідний розмір.",
        ],
      },
      for_children: {
        imageText:
          "Дітки часто ховаються з головою, якщо їм наснилося щось страшне, літає муха або замерзли, тому дуже важливо вибирати ковдру з високою повітропроникністю.",
        description:
          "Якщо зовнішню тканину можна розглянути, то про склад наповнювача поцікавтеся у консультанта. У дитячі ковдри до натурального пуху часто додають гусячі або качині пір'я для того, щоб додати обсяг. Такий наповнювач сильно вбирає вологу і може з часом відволожуватися, а це ідеальне середовище для появи пилових кліщів і бактерій.",
      },
    },
    author: {
      name: "Марія Балак",
      created_at: "12.04.2021",
      tags: ["постільна білизна", "діти", "ковдри", "екологічні матеріали"],
      socialLinks: {
        instagram: "#",
        facebook: "#",
        youtube: "",
        pinterest: "#",
        linkedin: "#",
      },
    },
  },
  {
    id: "3",
    topic: "Текстиль та мінімалізм",
    info: {
      images: {
        topicImg: TopicIMG3,
        complexityImg: ComplexityIMG,
        for_childrenImg: ForChildrenIMG,
        what_materials: WhatMaterialsIMG,
      },
      complexity: {
        title: "В чому може бути складність?",
        description:
          "Комфортне і 'правильне' дитяче ковдру забезпечить міцний сон не тільки дитині, а й батькам. Як правильно вибрати ковдру, і на що звертати увагу розглянемо нижче.",
      },
      requirements: {
        title: "Якою має бути ковдра?",
        description: [
          "1. Отвечать сезону: зимнее, летнее, межсезонное или одеяло-трансформер на все сезоны.",
          "2. Лёгким в весе. Взрослому человеку одеяло может казаться совсем лёгким, а для ребёнка лишний вес может стать причиной беспокойного сна.",
          "3. Высокого качества. Материалы низкого качества уже после первой стирки могут 'сесть', потерять цвет или стать неприятными на ощупь из-за скатышей.",
          "4. Простое в уходе. Выбирайте износостойкие ткани, которые легко отстирываются и быстро сохнут.",
          "5. С высокой воздухопроницаемостью. При выборе одеяла обращайте внимание на его возможности циркуляции воздуха.",
          "6. Вологостійке. Ковдра має мати здатність швидко вбирати і випаровувати вологу.",
          "7. Звертайте увагу на тепловіддачу. Гарне ковдра повинна зберігати тепло при цьому пропускаючи повітря.",
          "8. Гипоаллергенное. Навіть якщо у дитини немає алергії, враховуйте цей момент, адже натуральний пух або якісь матеріали, можуть стати причиною нежиті або сльозливості вранці.",
        ],
      },
      what_materials: {
        title: "З якого матеріалу обрати ковдру?",
        description: [
          "1. Можливо, ви здивуєтеся, але можете сміливо вибирати синтетичні матеріали. Поліестер пух за своїми якостями схожий на натуральний пух, але на відміну від натурального, не викликає алергії! У Balak Home є спеціально пошиту для діток ковдру 'Kids Line' з колекції Luxe Collection з 100% бавовни з наповнювачем поліестер пух.",
          "2. Ковдра з антиалергенних поліефірних волокон. Такий наповнювач практичний в догляді і забезпечить дитині комфортний сон. У колекції Luxe Collection ви можете знайти ковдру для дітей 'Favourite' з поліефірних волокон 'Double Air' з зовнішньої тканиною 100% мікрофібра. Таке ковдру залишається легким, м'яким і повітряним навіть після багаторазового прання.",
          "Вибираючи ковдру для свого малюка або на подарунок, називайте консультанту не лише вік дитини, а й його зростання, щоб правильно підібрати відповідний розмір.",
        ],
      },
      for_children: {
        imageText:
          "Дітки часто ховаються з головою, якщо їм наснилося щось страшне, літає муха або замерзли, тому дуже важливо вибирати ковдру з високою повітропроникністю.",
        description:
          "Якщо зовнішню тканину можна розглянути, то про склад наповнювача поцікавтеся у консультанта. У дитячі ковдри до натурального пуху часто додають гусячі або качині пір'я для того, щоб додати обсяг. Такий наповнювач сильно вбирає вологу і може з часом відволожуватися, а це ідеальне середовище для появи пилових кліщів і бактерій.",
      },
    },
    author: {
      name: "Марія Балак",
      created_at: "12.04.2021",
      tags: ["постільна білизна", "діти", "ковдри", "екологічні матеріали"],
      socialLinks: {
        instagram: "",
        facebook: "#",
        youtube: "",
        pinterest: "#",
        linkedin: "",
      },
    },
  },
  {
    id: "4",
    topic: "Життя вдома",
    info: {
      images: {
        topicImg: TopicIMG4,
        complexityImg: ComplexityIMG,
        for_childrenImg: ForChildrenIMG,
        what_materials: WhatMaterialsIMG,
      },
      complexity: {
        title: "В чому може бути складність?",
        description:
          "Комфортне і 'правильне' дитяче ковдру забезпечить міцний сон не тільки дитині, а й батькам. Як правильно вибрати ковдру, і на що звертати увагу розглянемо нижче.",
      },
      requirements: {
        title: "Якою має бути ковдра?",
        description: [
          "1. Отвечать сезону: зимнее, летнее, межсезонное или одеяло-трансформер на все сезоны.",
          "2. Лёгким в весе. Взрослому человеку одеяло может казаться совсем лёгким, а для ребёнка лишний вес может стать причиной беспокойного сна.",
          "3. Высокого качества. Материалы низкого качества уже после первой стирки могут 'сесть', потерять цвет или стать неприятными на ощупь из-за скатышей.",
          "4. Простое в уходе. Выбирайте износостойкие ткани, которые легко отстирываются и быстро сохнут.",
          "5. С высокой воздухопроницаемостью. При выборе одеяла обращайте внимание на его возможности циркуляции воздуха.",
          "6. Вологостійке. Ковдра має мати здатність швидко вбирати і випаровувати вологу.",
          "7. Звертайте увагу на тепловіддачу. Гарне ковдра повинна зберігати тепло при цьому пропускаючи повітря.",
          "8. Гипоаллергенное. Навіть якщо у дитини немає алергії, враховуйте цей момент, адже натуральний пух або якісь матеріали, можуть стати причиною нежиті або сльозливості вранці.",
        ],
      },
      what_materials: {
        title: "З якого матеріалу обрати ковдру?",
        description: [
          "1. Можливо, ви здивуєтеся, але можете сміливо вибирати синтетичні матеріали. Поліестер пух за своїми якостями схожий на натуральний пух, але на відміну від натурального, не викликає алергії! У Balak Home є спеціально пошиту для діток ковдру 'Kids Line' з колекції Luxe Collection з 100% бавовни з наповнювачем поліестер пух.",
          "2. Ковдра з антиалергенних поліефірних волокон. Такий наповнювач практичний в догляді і забезпечить дитині комфортний сон. У колекції Luxe Collection ви можете знайти ковдру для дітей 'Favourite' з поліефірних волокон 'Double Air' з зовнішньої тканиною 100% мікрофібра. Таке ковдру залишається легким, м'яким і повітряним навіть після багаторазового прання.",
          "Вибираючи ковдру для свого малюка або на подарунок, називайте консультанту не лише вік дитини, а й його зростання, щоб правильно підібрати відповідний розмір.",
        ],
      },
      for_children: {
        imageText:
          "Дітки часто ховаються з головою, якщо їм наснилося щось страшне, літає муха або замерзли, тому дуже важливо вибирати ковдру з високою повітропроникністю.",
        description:
          "Якщо зовнішню тканину можна розглянути, то про склад наповнювача поцікавтеся у консультанта. У дитячі ковдри до натурального пуху часто додають гусячі або качині пір'я для того, щоб додати обсяг. Такий наповнювач сильно вбирає вологу і може з часом відволожуватися, а це ідеальне середовище для появи пилових кліщів і бактерій.",
      },
    },
    author: {
      name: "Марія Балак",
      created_at: "12.04.2021",
      tags: ["постільна білизна", "діти", "ковдри", "екологічні матеріали"],
      socialLinks: {
        instagram: "#",
        facebook: "#",
        youtube: "#",
        pinterest: "",
        linkedin: "",
      },
    },
  },
  {
    id: "5",
    topic: "Виготовлення подушок",
    info: {
      images: {
        topicImg: TopicIMG5,
        complexityImg: ComplexityIMG,
        for_childrenImg: ForChildrenIMG,
        what_materials: WhatMaterialsIMG,
      },
      complexity: {
        title: "В чому може бути складність?",
        description:
          "Комфортне і 'правильне' дитяче ковдру забезпечить міцний сон не тільки дитині, а й батькам. Як правильно вибрати ковдру, і на що звертати увагу розглянемо нижче.",
      },
      requirements: {
        title: "Якою має бути ковдра?",
        description: [
          "1. Отвечать сезону: зимнее, летнее, межсезонное или одеяло-трансформер на все сезоны.",
          "2. Лёгким в весе. Взрослому человеку одеяло может казаться совсем лёгким, а для ребёнка лишний вес может стать причиной беспокойного сна.",
          "3. Высокого качества. Материалы низкого качества уже после первой стирки могут 'сесть', потерять цвет или стать неприятными на ощупь из-за скатышей.",
          "4. Простое в уходе. Выбирайте износостойкие ткани, которые легко отстирываются и быстро сохнут.",
          "5. С высокой воздухопроницаемостью. При выборе одеяла обращайте внимание на его возможности циркуляции воздуха.",
          "6. Вологостійке. Ковдра має мати здатність швидко вбирати і випаровувати вологу.",
          "7. Звертайте увагу на тепловіддачу. Гарне ковдра повинна зберігати тепло при цьому пропускаючи повітря.",
          "8. Гипоаллергенное. Навіть якщо у дитини немає алергії, враховуйте цей момент, адже натуральний пух або якісь матеріали, можуть стати причиною нежиті або сльозливості вранці.",
        ],
      },
      what_materials: {
        title: "З якого матеріалу обрати ковдру?",
        description: [
          "1. Можливо, ви здивуєтеся, але можете сміливо вибирати синтетичні матеріали. Поліестер пух за своїми якостями схожий на натуральний пух, але на відміну від натурального, не викликає алергії! У Balak Home є спеціально пошиту для діток ковдру 'Kids Line' з колекції Luxe Collection з 100% бавовни з наповнювачем поліестер пух.",
          "2. Ковдра з антиалергенних поліефірних волокон. Такий наповнювач практичний в догляді і забезпечить дитині комфортний сон. У колекції Luxe Collection ви можете знайти ковдру для дітей 'Favourite' з поліефірних волокон 'Double Air' з зовнішньої тканиною 100% мікрофібра. Таке ковдру залишається легким, м'яким і повітряним навіть після багаторазового прання.",
          "Вибираючи ковдру для свого малюка або на подарунок, називайте консультанту не лише вік дитини, а й його зростання, щоб правильно підібрати відповідний розмір.",
        ],
      },
      for_children: {
        imageText:
          "Дітки часто ховаються з головою, якщо їм наснилося щось страшне, літає муха або замерзли, тому дуже важливо вибирати ковдру з високою повітропроникністю.",
        description:
          "Якщо зовнішню тканину можна розглянути, то про склад наповнювача поцікавтеся у консультанта. У дитячі ковдри до натурального пуху часто додають гусячі або качині пір'я для того, щоб додати обсяг. Такий наповнювач сильно вбирає вологу і може з часом відволожуватися, а це ідеальне середовище для появи пилових кліщів і бактерій.",
      },
    },
    author: {
      name: "Марія Балак",
      created_at: "12.04.2021",
      tags: ["постільна білизна", "діти", "ковдри", "екологічні матеріали"],
      socialLinks: {
        instagram: "#",
        facebook: "#",
        youtube: "",
        pinterest: "",
        linkedin: "#",
      },
    },
  },
  {
    id: "6",
    topic: "Дизайни та поради поради по стилю",
    info: {
      images: {
        topicImg: TopicIMG6,
        complexityImg: ComplexityIMG,
        for_childrenImg: ForChildrenIMG,
        what_materials: WhatMaterialsIMG,
      },
      complexity: {
        title: "В чому може бути складність?",
        description:
          "Комфортне і 'правильне' дитяче ковдру забезпечить міцний сон не тільки дитині, а й батькам. Як правильно вибрати ковдру, і на що звертати увагу розглянемо нижче.",
      },
      requirements: {
        title: "Якою має бути ковдра?",
        description: [
          "1. Отвечать сезону: зимнее, летнее, межсезонное или одеяло-трансформер на все сезоны.",
          "2. Лёгким в весе. Взрослому человеку одеяло может казаться совсем лёгким, а для ребёнка лишний вес может стать причиной беспокойного сна.",
          "3. Высокого качества. Материалы низкого качества уже после первой стирки могут 'сесть', потерять цвет или стать неприятными на ощупь из-за скатышей.",
          "4. Простое в уходе. Выбирайте износостойкие ткани, которые легко отстирываются и быстро сохнут.",
          "5. С высокой воздухопроницаемостью. При выборе одеяла обращайте внимание на его возможности циркуляции воздуха.",
          "6. Вологостійке. Ковдра має мати здатність швидко вбирати і випаровувати вологу.",
          "7. Звертайте увагу на тепловіддачу. Гарне ковдра повинна зберігати тепло при цьому пропускаючи повітря.",
          "8. Гипоаллергенное. Навіть якщо у дитини немає алергії, враховуйте цей момент, адже натуральний пух або якісь матеріали, можуть стати причиною нежиті або сльозливості вранці.",
        ],
      },
      what_materials: {
        title: "З якого матеріалу обрати ковдру?",
        description: [
          "1. Можливо, ви здивуєтеся, але можете сміливо вибирати синтетичні матеріали. Поліестер пух за своїми якостями схожий на натуральний пух, але на відміну від натурального, не викликає алергії! У Balak Home є спеціально пошиту для діток ковдру 'Kids Line' з колекції Luxe Collection з 100% бавовни з наповнювачем поліестер пух.",
          "2. Ковдра з антиалергенних поліефірних волокон. Такий наповнювач практичний в догляді і забезпечить дитині комфортний сон. У колекції Luxe Collection ви можете знайти ковдру для дітей 'Favourite' з поліефірних волокон 'Double Air' з зовнішньої тканиною 100% мікрофібра. Таке ковдру залишається легким, м'яким і повітряним навіть після багаторазового прання.",
          "Вибираючи ковдру для свого малюка або на подарунок, називайте консультанту не лише вік дитини, а й його зростання, щоб правильно підібрати відповідний розмір.",
        ],
      },
      for_children: {
        imageText:
          "Дітки часто ховаються з головою, якщо їм наснилося щось страшне, літає муха або замерзли, тому дуже важливо вибирати ковдру з високою повітропроникністю.",
        description:
          "Якщо зовнішню тканину можна розглянути, то про склад наповнювача поцікавтеся у консультанта. У дитячі ковдри до натурального пуху часто додають гусячі або качині пір'я для того, щоб додати обсяг. Такий наповнювач сильно вбирає вологу і може з часом відволожуватися, а це ідеальне середовище для появи пилових кліщів і бактерій.",
      },
    },
    author: {
      name: "Марія Балак",
      created_at: "12.04.2021",
      tags: ["постільна білизна", "діти", "ковдри", "екологічні матеріали"],
      socialLinks: {
        instagram: "#",
        facebook: "#",
        youtube: "#",
        pinterest: "#",
        linkedin: "#",
      },
    },
  },
  {
    id: "7",
    topic: "Ковдри та подушки",
    info: {
      images: {
        topicImg: TopicIMG7,
        complexityImg: ComplexityIMG,
        for_childrenImg: ForChildrenIMG,
        what_materials: WhatMaterialsIMG,
      },
      complexity: {
        title: "В чому може бути складність?",
        description:
          "Комфортне і 'правильне' дитяче ковдру забезпечить міцний сон не тільки дитині, а й батькам. Як правильно вибрати ковдру, і на що звертати увагу розглянемо нижче.",
      },
      requirements: {
        title: "Якою має бути ковдра?",
        description: [
          "1. Отвечать сезону: зимнее, летнее, межсезонное или одеяло-трансформер на все сезоны.",
          "2. Лёгким в весе. Взрослому человеку одеяло может казаться совсем лёгким, а для ребёнка лишний вес может стать причиной беспокойного сна.",
          "3. Высокого качества. Материалы низкого качества уже после первой стирки могут 'сесть', потерять цвет или стать неприятными на ощупь из-за скатышей.",
          "4. Простое в уходе. Выбирайте износостойкие ткани, которые легко отстирываются и быстро сохнут.",
          "5. С высокой воздухопроницаемостью. При выборе одеяла обращайте внимание на его возможности циркуляции воздуха.",
          "6. Вологостійке. Ковдра має мати здатність швидко вбирати і випаровувати вологу.",
          "7. Звертайте увагу на тепловіддачу. Гарне ковдра повинна зберігати тепло при цьому пропускаючи повітря.",
          "8. Гипоаллергенное. Навіть якщо у дитини немає алергії, враховуйте цей момент, адже натуральний пух або якісь матеріали, можуть стати причиною нежиті або сльозливості вранці.",
        ],
      },
      what_materials: {
        title: "З якого матеріалу обрати ковдру?",
        description: [
          "1. Можливо, ви здивуєтеся, але можете сміливо вибирати синтетичні матеріали. Поліестер пух за своїми якостями схожий на натуральний пух, але на відміну від натурального, не викликає алергії! У Balak Home є спеціально пошиту для діток ковдру 'Kids Line' з колекції Luxe Collection з 100% бавовни з наповнювачем поліестер пух.",
          "2. Ковдра з антиалергенних поліефірних волокон. Такий наповнювач практичний в догляді і забезпечить дитині комфортний сон. У колекції Luxe Collection ви можете знайти ковдру для дітей 'Favourite' з поліефірних волокон 'Double Air' з зовнішньої тканиною 100% мікрофібра. Таке ковдру залишається легким, м'яким і повітряним навіть після багаторазового прання.",
          "Вибираючи ковдру для свого малюка або на подарунок, називайте консультанту не лише вік дитини, а й його зростання, щоб правильно підібрати відповідний розмір.",
        ],
      },
      for_children: {
        imageText:
          "Дітки часто ховаються з головою, якщо їм наснилося щось страшне, літає муха або замерзли, тому дуже важливо вибирати ковдру з високою повітропроникністю.",
        description:
          "Якщо зовнішню тканину можна розглянути, то про склад наповнювача поцікавтеся у консультанта. У дитячі ковдри до натурального пуху часто додають гусячі або качині пір'я для того, щоб додати обсяг. Такий наповнювач сильно вбирає вологу і може з часом відволожуватися, а це ідеальне середовище для появи пилових кліщів і бактерій.",
      },
    },
    author: {
      name: "Марія Балак",
      created_at: "12.04.2021",
      tags: ["постільна білизна", "діти", "ковдри", "екологічні матеріали"],
      socialLinks: {
        instagram: "#",
        facebook: "#",
        youtube: "",
        pinterest: "",
        linkedin: "",
      },
    },
  },
  {
    id: "8",
    topic: "Прання текстильних виробів",
    info: {
      images: {
        topicImg: TopicIMG8,
        complexityImg: ComplexityIMG,
        for_childrenImg: ForChildrenIMG,
        what_materials: WhatMaterialsIMG,
      },
      complexity: {
        title: "В чому може бути складність?",
        description:
          "Комфортне і 'правильне' дитяче ковдру забезпечить міцний сон не тільки дитині, а й батькам. Як правильно вибрати ковдру, і на що звертати увагу розглянемо нижче.",
      },
      requirements: {
        title: "Якою має бути ковдра?",
        description: [
          "1. Отвечать сезону: зимнее, летнее, межсезонное или одеяло-трансформер на все сезоны.",
          "2. Лёгким в весе. Взрослому человеку одеяло может казаться совсем лёгким, а для ребёнка лишний вес может стать причиной беспокойного сна.",
          "3. Высокого качества. Материалы низкого качества уже после первой стирки могут 'сесть', потерять цвет или стать неприятными на ощупь из-за скатышей.",
          "4. Простое в уходе. Выбирайте износостойкие ткани, которые легко отстирываются и быстро сохнут.",
          "5. С высокой воздухопроницаемостью. При выборе одеяла обращайте внимание на его возможности циркуляции воздуха.",
          "6. Вологостійке. Ковдра має мати здатність швидко вбирати і випаровувати вологу.",
          "7. Звертайте увагу на тепловіддачу. Гарне ковдра повинна зберігати тепло при цьому пропускаючи повітря.",
          "8. Гипоаллергенное. Навіть якщо у дитини немає алергії, враховуйте цей момент, адже натуральний пух або якісь матеріали, можуть стати причиною нежиті або сльозливості вранці.",
        ],
      },
      what_materials: {
        title: "З якого матеріалу обрати ковдру?",
        description: [
          "1. Можливо, ви здивуєтеся, але можете сміливо вибирати синтетичні матеріали. Поліестер пух за своїми якостями схожий на натуральний пух, але на відміну від натурального, не викликає алергії! У Balak Home є спеціально пошиту для діток ковдру 'Kids Line' з колекції Luxe Collection з 100% бавовни з наповнювачем поліестер пух.",
          "2. Ковдра з антиалергенних поліефірних волокон. Такий наповнювач практичний в догляді і забезпечить дитині комфортний сон. У колекції Luxe Collection ви можете знайти ковдру для дітей 'Favourite' з поліефірних волокон 'Double Air' з зовнішньої тканиною 100% мікрофібра. Таке ковдру залишається легким, м'яким і повітряним навіть після багаторазового прання.",
          "Вибираючи ковдру для свого малюка або на подарунок, називайте консультанту не лише вік дитини, а й його зростання, щоб правильно підібрати відповідний розмір.",
        ],
      },
      for_children: {
        imageText:
          "Дітки часто ховаються з головою, якщо їм наснилося щось страшне, літає муха або замерзли, тому дуже важливо вибирати ковдру з високою повітропроникністю.",
        description:
          "Якщо зовнішню тканину можна розглянути, то про склад наповнювача поцікавтеся у консультанта. У дитячі ковдри до натурального пуху часто додають гусячі або качині пір'я для того, щоб додати обсяг. Такий наповнювач сильно вбирає вологу і може з часом відволожуватися, а це ідеальне середовище для появи пилових кліщів і бактерій.",
      },
    },
    author: {
      name: "Марія Балак",
      created_at: "12.04.2021",
      tags: ["постільна білизна", "діти", "ковдри", "екологічні матеріали"],
      socialLinks: {
        instagram: "#",
        facebook: "",
        youtube: "",
        pinterest: "",
        linkedin: "",
      },
    },
  },
];

export default function BlogPage() {
  return (
    <>
      <BlogHead articles={articles.slice(0, 5)} />
      <WithColorFillingBlock
        image={TextilesIMG}
        title={"Текстиль та тренди 2021"}
        link={CompanyUrl.getArticle(articles[2].id)}
        bgColor={"bg-[#65A9A0]"}
      />
      <Section>
        <Container>
          <div className={"my-24"}>
            <BlogGrid articles={articles.slice(2).reverse()} />
          </div>
        </Container>
      </Section>
      <WithColorFillingBlock
        image={CareOfPillowsIMG}
        title={"Догляд за подушками"}
        link={CompanyUrl.getArticle(articles[4].id)}
        bgColor={"bg-[#703F4D]"}
      />
      <Section>
        <Container>
          <div className={"mb-24 mt-24 flex flex-col gap-y-[72px]"}>
            <BlogGrid articles={articles.slice(3, 6)} />
            <Pagination total={3} activePage={1} />
          </div>
        </Container>
      </Section>
    </>
  );
}
