import { Container, Section, Title } from "common/ui";

export default function PrivacyPolicyPage() {
  return (
    <Section size={"default"}>
      <Container>
        <Title size="3xl">Договір публічної оферти</Title>
        <Section size="small">
          <Title size="xl">Загальні положення</Title>
          <p className="py-4">1.1. Справжня оферта є офіційною пропозицією ТМ «ТЕП», далі за текстом - «Продавець», укласти Договір купівлі-продажу товарів дистанційним способом, тобто через Інтернет-магазин, далі по тексту - «Договір», і розміщує Публічну оферту (пропозицію) на офіційному інтернет-сайті Продавця «https://tep.ua (далі - Інтернет-сайт).</p>
          <p className="py-4">1.2. Моментом повного і безумовного прийняття Покупцем пропозиції Продавця (акцептом) укласти електронний договір купівлі-продажу товарів, вважається факт оплати Покупцем замовлення на умовах цього Договору, у строки та за цінами, вказаними на Інтернет-сайті Продавця.</p>
        </Section>
        <Section size="small">
          <Title size="xl">Поняття і визначення</Title>
          <p className="py-4">2.1. У цій оферті, якщо контекст не вимагає іншого, наведені нижче терміни мають таке значення:</p>
          <p className="py-4">*«Товар» - предмет торгівлі (виріб, модель, аксесуар, комплектуючі та супутні предмети, будь-які інші предмети торгівлі) продавця.</p>
          <p className="py-4">* «Інтернет-магазин» - відповідно до Закону України «про електронну комерцію», засіб для подання або реалізації товару, роботи або послуги шляхом здійснення електронної угоди.</p>
          <p className="py-4">* «Продавець» - компанія, яка реалізує товари, представлені на Інтернет-сайті.</p>
          <p className="py-4">* «Покупець» - фізична особа, що уклала з Продавцем Договір на умовах, викладених нижче.</p>
          <p className="py-4">* «Замовлення» - вибір окремих позицій з переліку товарів, зазначених Покупцем при розміщенні замовлення і проведенні оплати.</p>
        </Section>
        <Section size="small">
          <Title size="xl">Предмет договору</Title>
          <p className="py-4">3.1. Продавець зобов'язується передати у власність Покупця Товар, а Покупець зобов'язується оплатити і прийняти Товар на умовах даного Договору.</p>
          <p className="py-4">Цей Договір регулює купівлю-продаж товарів в Інтернет-магазині, в тому числі:</p>
          <p className="py-4">- добровільний вибір Покупцем товарів в Інтернет-магазині;</p>
          <p className="py-4">- самостійне оформлення Покупцем замовлення в Інтернет-магазині;</p>
          <p className="py-4">- оплата Покупцем замовлення, оформленого в Інтернет-магазині;</p>
          <p className="py-4">- обробка та доставка замовлення Покупцеві у власність на умовах цього Договору.</p>
        </Section>
        <Section size="small">
          <Title size="xl">Порядок оформлення замовлення</Title>
          <p className="py-4">4.1.Покупець має право оформити замовлення на будь-який товар, представлений на Сайті Інтернет-магазину і наявний.</p>
          <p className="py-4">4.2.Кожна позиція може бути представлена ​​в замовленні в будь-якій кількості.</p>
          <p className="py-4">4.3. При відсутності товару на складі, Менеджер компанії зобов'язаний поставити Покупця до відома (по телефону або через електронну пошту).</p>
          <p className="py-4">4.4. При відсутності товару Покупець має право замінити його товаром аналогічної моделі, відмовитися від даного товару, анулювати замовлення.</p>
        </Section>
        <Section size="small">
          <Title size="xl">Умови доставки товару</Title>
          <p className="py-4">5.1 Покупець отримує Товар за допомогою доставки, або отримує його особисто. Порядок оплати і отримання зазначений на відповідній сторінці Веб-сайту https://tep.ua/</p>
          <p className="py-4">5.2. При доставці Товарів в інші міста України або на території іншої країни, виконуваної іншими Службами доставки (далі Компаніями-перевізниками) Покупець в повному обсязі і беззастережно погоджується з Правилами перевезення вантажів цими компаніями-перевізниками.</p>
          <p className="py-4">5.3. Факт отримання Товару та відсутність претензій до якості Товару, що доставляється Компаніями-перевізниками, Покупець підтверджує власним підписом в товаротранспортній накладній, декларації Компанії-перевізника, або у видатковій накладній при отриманні Товару. Зі свого боку, Продавець гарантує відвантаження Товару Компанії-перевізнику в кількості, зазначеній і сплаченому Покупцем, в комплектності згідно специфікації цього Товару та в належному стані і якості.</p>
          <p className="py-4">5.4. У разі відсутності Покупця за адресою доставки, зазначеної Покупцем в заявці або відмови Покупця від отримання Товару по необґрунтованих причинах, при доставці Кур'єром компанії-перевізника, Товар повертається в центр відвантаження. Оплата за послуги Компанії-перевізника віднімається від суми, перерахованої Покупцем за Товар. Залишок суми повертається Покупцю на підставі його листа із зазначенням розрахункового рахунку, на який повинні бути повернені кошти.</p>
          <p className="py-4">Всі питання, що виникли в процесі оплати та отримання Товару, Покупець може з'ясувати за контактними даними в розділі Контакти.</p>
        </Section>
        <Section size="small">
          <Title size="xl">Права та обов'язки сторін:</Title>
          <p className="py-4">6.1. Продавець має право:</p>
          <p className="py-4">- в односторонньому порядку припинити надання послуг за цим договором у разі порушення Покупцем умов цього договору.</p>
          <p className="py-4">6.2. Покупець зобов'язаний:</p>
          <p className="py-4">- своєчасно оплатити та отримати замовлення на умовах цього договору.</p>
          <p className="py-4">6.3. Покупець має право:</p>
          <p className="py-4">- оформити замовлення в Інтернет-магазині;</p>
          <p className="py-4">- оформити електронний договір;</p>
          <p className="py-4">- вимагати від Продавця виконання умов цього Договору.</p>
        </Section>
        <Section size="small">
          <Title size="xl">Відповідальність сторін</Title>
          <p className="py-4">7.1. Сторони несуть відповідальність за невиконання або неналежне виконання умов цього договору в порядку, передбаченому цим договором та чинним законодавством України.</p>
          <p className="py-4">7.2. Продавець не несе відповідальності за:</p>
          <p className="py-4">- змінений виробником зовнішній вигляд Товару;</p>
          <p className="py-4">- за незначну невідповідність кольорової гами товару, що може відрізнятися від оригіналу товару виключно через різній колірній передачі моніторів персональних комп'ютерів окремих моделей;</p>
          <p className="py-4">- за зміст і правдивість інформації, наданої Покупцем при оформленні замовлення;</p>
          <p className="py-4">- за затримку і перебої в наданні Послуг (обробки замовлення та доставки товару), які відбуваються з причин, що знаходяться поза сферою його контролю;</p>
          <p className="py-4">-за протиправні незаконні дії, здійснені Покупцем за допомогою даного доступу до мережі Інтернет;</p>
          <p className="py-4">- за передачу Покупцем своїх мережевих ідентифікаторів - IP, MAC-адреси, логіна і пароля третім особам;</p>
          <p className="py-4">7.3. Покупець, використовуючи наданий йому доступ до мережі Інтернет, самостійно несе відповідальність за шкоду, заподіяну його діями (особисто, навіть якщо під його логіном знаходилась інша особа) особам або їх майну, юридичним особам, державі чи моральним принципам моральності.</p>
          <p className="py-4">7.4. У разі настання обставин непереборної сили, сторони звільняються від виконання умов цього договору. Під обставинами непереборної сили для цілей цього договору розуміються події, що мають надзвичайний, непередбачений характер, які виключають або об'єктивно заважають виконанню цього договору, настання яких Сторони не могли передбачити і запобігти розумними способами.</p>
          <p className="py-4">7.5.Сторони прикладають максимум зусиль для вирішення будь-яких розбіжностей виключно шляхом переговорів.</p>
        </Section>
        <Section size="small">
          <Title size="xl">Інші умови</Title>
          <p className="py-4">8.1. Інтернет-магазин залишає за собою право в односторонньому порядку вносити зміни до цього договору за умови попередньої публікації його на сайті https://tep.ua</p>
          <p className="py-4">8.2. Інтернет-магазин створений для організації дистанційного способу продажу товарів через Інтернет.</p>
          <p className="py-4">8.3. Покупець несе відповідальність за достовірність інформації, зазначеної при оформленні замовлення інформації. При цьому, при здійсненні акцепту (оформленні замовлення і подальшої оплати товару) Покупець надає Продавцю свою беззастережну згоду на збір, обробку, зберігання, використання своїх персональних даних, в розумінні ЗУ «Про захист персональних даних».</p>
          <p className="py-4">8.4. Оплата Покупцем оформленого в Інтернет-магазині замовлення означає повну згоду Покупця з умовами договору купівлі-продажу (публічної оферти)</p>
          <p className="py-4">8.5. Фактичною датою електронної угоди між сторонами є дата прийняття умов, відповідно до ст. 11 Закону України «Про електронну комерцію»</p>
          <p className="py-4">8.6. Використання ресурсу Інтернет-магазину для попереднього перегляду товару, а також для оформлення замовлення для Покупця є безкоштовним.</p>
          <p className="py-4">8.7. Інформація, яка надається Покупцем, є конфіденційною. Інтернет-магазин використовує інформацію про Покупця виключно в цілях обробки замовлення, відправлення повідомлень Покупцеві, доставки товару, здійснення взаєморозрахунків і ін.</p>
        </Section>
        <Section size="small">
          <Title size="xl">Порядок повернення товару належної якості</Title>
          <p className="py-4">9.1. Повернення товару в Інтернет-магазин проводиться згідно чинного законодавства України.</p>
          <p className="py-4">9.2. Повернення товару в Інтернет-магазин проводиться за рахунок Покупця.</p>
          <p className="py-4">9.3. При поверненні Покупцем товару належної якості, Інтернет-магазин повертає йому сплачену за товар грошову суму за фактом повернення товару за вирахуванням компенсації витрат Інтернет-магазину пов'язаних з доставкою товару Покупцеві.</p>
        </Section>
        <Section size="small">
          <Title size="xl">Термін дії договору</Title>
          <p className="py-4">10.1. Електронний договір вважається укладеним з моменту одержання особою, яка направила пропозицію укласти такий договір, відповіді про прийняття цієї пропозиції в порядку, визначеному частиною шостою статті 11 Закону України "Про електронну комерцію".</p>
          <p className="py-4">10.2. До закінчення терміну дії цей Договір може бути розірваний за взаємною згодою сторін до моменту фактичної доставки товару, шляхом повернення грошових коштів</p>
          <p className="py-4">10.3. Сторони мають право розірвати цей договір в односторонньому порядку, в разі невиконання однією із сторін умов цього Договору та у випадках, передбачених чинним законодавством України.</p>
        </Section>
      </Container>
    </Section>
  );
}
