import { OurHistory } from "components/Company/About/OurHistory";
import Technologies from "components/Company/About/Technologies";
import AdvantagesIMG from "components/Company/About/static/advantages.jpg";
import DreamsIMG from "components/Company/About/static/dreams.jpg";
import GoalsIMG from "components/Company/About/static/goals.jpg";
import MainIMG from "components/Company/About/static/main-about.jpg";
import MissionIMG from "components/Company/About/static/mission.jpg";
import ProductionIMG from "components/Company/About/static/production.jpg";
import { ContentBlock } from "components/Company/ContentBlock";
import { ImageBlock } from "components/Company/ImageBlock";
import { MainImageBlock } from "components/Company/MainImageBlock";

export default function Page() {
  return (
    <>
      <MainImageBlock image={MainIMG} title={"Бренд ТЕП"} />
      <ContentBlock
        className={"py-24"}
        text={[
          "Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення. Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення.",
        ]}
        title={"Місія та бізнес ідея"}
        image={MissionIMG}
      />
      <OurHistory />
      <ImageBlock
        className={"mb-24"}
        size={"large"}
        image={DreamsIMG}
        description={
          "Будь собою та поводься справжньо, здійснюй будь-які мрії, ти зможеш і ніхто тебе не зупинить. Постіль — місце сили для справжнього тебе із власними мріями!"
        }
      />
      <ContentBlock
        className={"mb-24"}
        title={"Наші цілі та мрії"}
        text={[
          "Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення. Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення.",
        ]}
        image={GoalsIMG}
      />
      <ContentBlock
        className={"mb-24"}
        title={"Переваги"}
        text={[
          "Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення. Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення.",
        ]}
        image={AdvantagesIMG}
      />
      <ContentBlock
        className={"mb-24 lg:mb-40"}
        title={"Виробництво"}
        text={[
          "Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення. Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення.",
          "Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення. Ми починали як невелика чернівецька компанія, що відправляє поштою замовлення через каталог і стали одним із найбільш відомих в Україні брендів текстильних товарів. Сьогодні у різних країнах починають працювати магазини ТЕП, і ми плануємо збільшити цю кількість. Дізнайтесь більше про нашу захопливу історію – з самого початку до сьогодення.",
        ]}
        image={ProductionIMG}
      />
      <Technologies />
    </>
  );
}
