import { cn } from "utils/cn";

import { Container, Section, Title } from "common/ui";

const content = [
  {
    year: "1996",
    text: "Наша історія починається наприкінці 20-го століття з пошиття ковдр із тканин з чотирьох дизайнів в місті Чернівці, Україна. Саме тоді зародилася ідея створення бренду ТЕП, який подарував би людям якісний та доступний домашній текстиль. Назва ТЕП походить від слова \"тепло\" (укр.). Усього 14 людей працювало тоді над загальною улюбленою справою. Пошиття постільної білизни відбувалось в розмірах полуторний та євростандарт, а ковдри шились на двох одноголкових стьобальних машинах.",
  },
  {
    year: "2000",
    text: "Переїзд на нову, велику площу для виробництва та головного офісу. Ми - компанія «Балакком» – закуповуємо нові перші чотиригольні комп'ютерно-автоматичні машини для різних дизайнів простібування та розмірів (дитячі, полуторні, двоспальні, євро стандарт). Крім того, у нас з'являється можливість міняти малюнок на ковдрах. А у 2001 році ми починаємо пошиття подушок!",
  },
  {
    year: "2002",
    text: "Придбали італійську багатоголкову стьобальну машину Meсa, яка дозволила шити більш технологічні ковдри, зробивши цим їх ще якіснішими. Саме в цей час компанія починає також пошиття покривал на виробництві. А наступного 2003 року Балакком запускає пошиття постільної білизни торгової марки ТЕП.",
  },
  {
    year: "2007",
    text: "Закуповуємо німецьку машину Dilo для виробництва нетканого термоскріпленого матеріалу. Це дало змогу збільшити асортимент та випуск ковдр, наматрацників і покривал.",
  },
  {
    year: "2009",
    text: "Компанія закупила першу автоматичну лінію для наповнювачів чохлів подушок різним типом сировини, у тому числі силіконізованих куль з порожнистих волокон.",
  },
  {
    year: "2010",
    text: "Балакком купує автоматизовану лінію для виробництва ковдр: чесальну машину для ковдр Asseline-Thibeau, багатоголкові машини Mammut.",
  },
  {
    year: "2017",
    text: "Докупка двох додаткових машин для виробництва ковдр та наматрацників, а вже наступного 2013 року компанія купує нове обладнання для наповнення чохлів для подушок з ультратонкими волокнами.",
  },
  {
    year: "2018",
    text: "Компанія Балакком виготовляє 30 видів ковдр, 50 видів подушок, 8 видів покривал, 20 наматрацників, 4 сегменти постільної білизни і є серед лідерів ринку домашнього текстилю. В компанії працює близько 500 співробітників, Балакком не раз вигравала сертифікати та перемоги в номінаціях «Краща якість» та «Кращі товари», має сертифікат ISO 9001, що підтверджує високі стандарти якості компанії. Наша місія – подарувати здоровий сон кожному, цим зробити вас щасливішими та успішнішими.",
  },
  {
    year: "2022",
    text: "Наша місія — забезпечити здоровий сон кожного, зробити людей щасливішим та успішнішим. Бренд ТЕП та компанія Balakkom отримали оновлений стиль та брендинг."
  }
];

export function OurHistory() {
  return (
    <Section className={"mb-10 md:mb-24"}>
      <Container>
        <div>
          <Title className={"mb-20 text-3xl md:mb-24"}>Історія в цифрах:</Title>
          <div className={"pl-3"}>
            {content.map((el, Idx, arr) => (
              <div
                key={el.year}
                className={cn("min-h-[180px] pl-8 md:pl-12", {
                  "border-tep_blue-400/20 border-l-2 pb-12":
                    Idx < arr.length - 1,
                })}
              >
                <div
                  className={cn(
                    "relative -translate-y-6 text-5xl font-bold before:absolute before:-left-[33px] before:top-6 before:h-4 before:w-4 before:-translate-x-1/2 before:-translate-y-1/2 before:rounded-full before:bg-tep_blue-500 md:before:-left-[49px]",
                    {
                      "before:-left-[31px] before:h-6 before:w-6 md:before:-left-[47px]":
                        Idx === arr.length - 1,
                    },
                  )}
                >
                  {el.year}
                </div>
                <p
                  className={
                    "max-w-[818px] text-lg md:text-sm lg:font-extralight"
                  }
                >
                  {el.text}
                </p>
              </div>
            ))}
          </div>
        </div>
      </Container>
    </Section>
  );
}
