import { cn } from "utils/cn";

import { Container, Section, Title } from "common/ui";

const content = [
  {
    year: "1996",
    text: "Наша історія починається в кінці 20-го століття з пошиття ковдр з використанням чотирьох тканин різного дизайну в місті Чернівці, Україна. Саме тоді зародилася ідея створення бренду ТЕП, який би подарував людям якісний домашній текстиль для дому. Сама назва ТЕП йде від слова «тепло» (укр.). Всього 14 чоловік працювало на той момент над загальним улюбленою справою. Пошиття постільної білизни в розмірах полуторний і євро стандарт, а також ковдр відбувався на двох одноголкових стьобальних машинах.",
  },
  {
    year: "2000",
    text: "Переїзд на нову, велику площу для виробництва і головного офісу. Ми - компанія «Балакком» закуповуємо нові перші четирехігольние комп'ютерно-автоматичні машини для різних дизайнів Повітряні змії і розмірів (дитячі, полуторні, двоспальні, євро стандарт). Крім цього, у нас з'являється можливість змінювати малюнок на ковдрах. А в 2001 році ми починаємо пошиття подушок!",
  },
  {
    year: "2002",
    text: "Вперше купили італійську багатоголкові стьобальні машину Mesa, яка дозволила пошити більш технологічні ковдри, зробивши цим їх ще більш якісніше. Саме в цей час компанія починає також пошиття покривал на виробництві. А в наступному 2003 році Балакком запускає пошиття постільної білизни торгової марки ТЕП.",
  },
  {
    year: "2007",
    text: "Вперше закуповуємо німецьку машину для виробництва нетканого термоскріплення матеріалу, це дало можливість збільшити випуск ковдр і наматрацників, покривав, а також виготовляти вироби різних типів.",
  },
  {
    year: "2009",
    text: "Компанія закупила першу автоматичну лінію для наповнювачів чохлів подушок різним типом сировини, в тому числі силіконізованих куль пустотілих волокон. Також зароджується ідея створення бренду нижньої білизни та одягу для сну EGO, тому Балакком запускає трикотажні швейні машини.",
  },
  {
    year: "2010",
    text: "Балакком купує автоматизовану лінію для виробництва: чесальну машину для ковдр Salin Tibbo, багатоголкові машину Mammut.",
  },
  {
    year: "2012",
    text: "Докупка двох додаткових машин для ковдр і наматрацників, а вже в наступному 2013 року компанія вирішується купити машину для наповнення чохлів для подушок з ультратонкими волокнами.",
  },
  {
    year: "2017",
    text: "Створення бренду Balak Home з європейськими стандартами і високою якістю. Вперше бренд почули в Німеччині, де він і до цього дня дуже затребуваний і відомий. В Україні з'явився в 2018, також, як і в Росії.",
  },
  {
    year: "2018 та сьогодні",
    text: "Компанія Балакком є ​​лідером ринку текстилю в Україні, має велике виробництво, а також асортимент: 30 видів ковдр, 50 видів подушок, 8 видів покривал, 20 по наматрацники, 4 сегмента постільної білизни. Крім цього, на сьогодні в компанії працює близько 500 співробітників, Балакком не раз вигравала сертифікати і перемоги в номінаціях «Краща якість» і «Кращі товари», має сертифікат ISO 9001, що підтверджує високі стандарти якості компанії. Наша місія - подарувати здоровий сон кожному, цим зробити вас щасливішими і успішними",
  },
];

export function OurHistory() {
  return (
    <Section className={"mb-10 md:mb-24"}>
      <Container>
        <div>
          <Title className={"mb-20 text-3xl md:mb-24"}>Наша історія</Title>
          <div className={"pl-3"}>
            {content.map((el, Idx, arr) => (
              <div
                key={el.year}
                className={cn("min-h-[180px] pl-8 md:pl-12", {
                  "border-tep_blue-400/20 border-l-2 pb-12":
                    Idx < arr.length - 1,
                })}
              >
                <div
                  className={cn(
                    "relative -translate-y-6 text-5xl font-bold before:absolute before:-left-[33px] before:top-6 before:h-4 before:w-4 before:-translate-x-1/2 before:-translate-y-1/2 before:rounded-full before:bg-tep_blue-500 md:before:-left-[49px]",
                    {
                      "before:-left-[31px] before:h-6 before:w-6 md:before:-left-[47px]":
                        Idx === arr.length - 1,
                    },
                  )}
                >
                  {el.year}
                </div>
                <p
                  className={
                    "max-w-[818px] text-lg md:text-sm lg:font-extralight"
                  }
                >
                  {el.text}
                </p>
              </div>
            ))}
          </div>
        </div>
      </Container>
    </Section>
  );
}
